<?php

//SHORT NAMES FOR COMBAT REPORTS
$LNG['tech_rc'] = array (
202 => 'М.транспорт',
203 => 'Б.транспорт',
204 => 'М.истребитель',
205 => 'Б.истребитель',
206 => 'Крейсер',
207 => 'Линкор',
208 => 'Колонизатор',
209 => 'Переработчик',
210 => 'Шп. зонд',
211 => 'Бомбардировщик',
212 => 'Солн. спутник',
213 => 'Уничтожитель',
214 => 'Зв.смерти',
215 => 'Лин.крейсер',
216 => 'Супернова',
217 => 'Ул. транспорт',
218 => 'Аватар',
219 => 'М. Переработчик',
220 => 'Интер. сборщ. ТМ',
221 => 'Тэррор',
222 => 'Бегемот',
223 => 'З. ловец',
224 => 'Ифрит',
225 => 'Шива',
226 => 'Кентавр',
227 => 'Эпсилон',
228 => 'Один',

401 => 'Ракетн.уст.',
402 => 'Л.лазер',
403 => 'Б.лазер',
404 => 'Оруд.Гаусса',
405 => 'Ионное оруд.',
406 => 'Плазменное оруд.',
407 => 'М.щит',
408 => 'Б.щит',
409 => 'Г.щит',
410 => 'Грав. оруд.',
411 => 'О.З.П.',
);



$LNG['tech'] = array(
  0 => 'Постройки',
  1 => 'Рудник по добыче металла',
  2 => 'Рудник по добыче кристалла',
  3 => 'Синтезатор дейтерия',
  4 => 'Солнечная электростанция',
  6 => 'Университет',
 12 => 'Термоядерный реактор',
 14 => 'Фабрика роботов',
 15 => 'Нанофабрика',
 21 => 'Верфь',
 22 => 'Хранилище металла',
 23 => 'Хранилище кристалла',
 24 => 'Емкость для дейтерия',
 31 => 'Исследовательская лаборатория',
 33 => 'Терраформер',
 34 => 'Склад альянса',
 44 => 'Ракетная шахта',

 
 40 => 'Лунные постройки',
 41 => 'Лунная база',
 42 => 'Сенсорная фаланга',
 43 => 'Телепорт',
// Technologies
100 => 'Исследования',
106 => 'Технология шпионажа',
108 => 'Компьютерная технология',
109 => 'Оружейная технология',
110 => 'Щитовая технология',
111 => 'Технология брони космических кораблей',
113 => 'Энергетическая технология',
114 => 'Гиперпространственная технология',
115 => 'Ракетный двигатель',
117 => 'Импульсный двигатель',
118 => 'Гиперпростр. двигатель',
120 => 'Лазерная технология',
121 => 'Ионная технология',
122 => 'Плазменная технология',
123 => 'Межгалактическая исследовательская сеть',
124 => 'Экспедиционная технология',
131 => 'Улучшенная добыча металла',
132 => 'Улучшенная добыча кристаллов',
133 => 'Улучшенная добыча дейтерия',
199 => 'Гравитационная технология',

200 => 'Флот',
202 => 'Малый транспорт',
203 => 'Большой транспорт',
204 => 'Легкий истребитель',
205 => 'Тяжелый истребитель',
206 => 'Крейсер',
207 => 'Линкор',
208 => 'Колонизатор',
209 => 'Переработчик',
210 => 'Шпионский зонд',
211 => 'Бомбардировщик',
212 => 'Солнечный спутник',
213 => 'Уничтожитель',
214 => 'Звезда смерти',
215 => 'Линейный крейсер',
216 => 'Супернова',
217 => 'Улучшенный транспорт',
218 => 'Аватар',
219 => 'Мега переработчик',
220 => 'Межгалактический сборщик ТМ',
221 => 'Тэррор',
222 => 'Бегемот',
223 => 'Звездный ловец',
224 => 'Звездный Титан Ифрит',
225 => 'Звездный Титан Шива',
226 => 'Звездный Титан Кентавр',
227 => 'Звездный Титан Эпсилон',
228 => 'Звездный Титан Один',

400 => 'Система обороны',
401 => 'Ракетная установка',
402 => 'Легкий лазер',
403 => 'Тяжелый лазер',
404 => 'Пушка Гаусса',
405 => 'Ионное орудие',
406 => 'Плазменное орудие',
407 => 'Малый купол',
408 => 'Большой купол',
409 => 'Гигантский купол',
410 => 'Гравитационное орудие',
411 => 'Орбитальная защитная платформа',

502 => 'Ракета-перехватчик',
503 => 'Межпланетная ракета',

600 => 'Офицеры',
601 => 'Геолог',
602 => 'Адмирал',
603 => 'Инженер',
604 => 'Технократ',
605 => 'Конструктор',
606 => 'Ученый',
607 => 'Хранитель',
608 => 'Министр обороны',
609 => 'Защитник',
610 => 'Шпион',
611 => 'Командир',
612 => 'Уничтожитель',
613 => 'Генерал',
614 => 'Рейдер',
615 => 'Император',

700 => 'Оптимизация оружия',
701 => 'Оптимизация щитов',
702 => 'Координатор построек',
703 => 'Оптимизация ресурсов',
704 => 'Оптимизация энергии',
705 => 'Оптимизация исследований',
706 => 'Координатор флота',
);

$LNG['res']['descriptions'] = array(
1 => 'Основной поставщик сырья для строительства несущих структур построек и кораблей.',
2 => 'Основной поставщик сырья для электронных строительных элементов и сплавов.',
3 => 'Извлекает из воды на планете незначительную долю дейтерия.',
4 => 'Производит энергию из солнечных лучей. Энергия требуется для работы большинства построек. ',
6 => 'Здесь собираются гениальные умы вашей империи что бы решать задачи как в теории так и на практике.',
12 => 'Добывает энергию из процесса образования атома гелия двумя атомами тяжёлого водорода.',
14 => 'Предоставляет простую рабочую силу, которую можно применять при строительстве планетарной инфраструктуры. Каждый уровень развития фабрики повышает скорость строительства зданий. ',
15 => 'Фабрика нанитов производит специальных эволюционированных роботов - нанитов. Наниты - это роботы, которые путём объединения в состоянии выполнять экстраординарные задания.',
21 => 'В строительной верфи производятся все виды кораблей и оборонительных сооружений.',
22 => 'Хранилище для необработанных руд Металлов до их дальнейшей переработки.',
23 => 'Хранилище для необработанного Кристалла до его дальнейшей переработки.',
24 => 'Огромные ёмкости для сбережения добытого дейтерия.',
31 => 'Необходима для исследования новых технологий.',
33 => 'Терраформер может преобразовывать огромные территории делая их пригодными для застройки.',
34 => 'Склад альянса предоставляет возможность обеспечения топливом дружественных флотов, которые помогают при обороне и находятся на орбите.',
41 => 'Луна не располагает атмосферой, поэтому перед заселением требуется соорудить лунную базу.',
42 => 'Высокочастотные сенсоры полностью просматривают спектр частот всех попадающих на фалангу излучений.',
43 => 'Телепорт - это огромные врата, которые могут пересылать между собой флоты любых размеров без временных затрат.',
44 => 'Служит для хранения ракет.',

106 => 'С помощью этой технологии добываются данные о других планетах.',
108 => 'С увеличением мощности компьютеров можно командовать всё большим количеством флотов. Каждый уровень компьютерной технологии увеличивает максимальное количество флотов на один. ',
109 => 'Оружейная технология делает системы вооружения эффективней. Каждый уровень увеличивает мощность вооружения войсковых частей на 10% от основной мощности. ',
110 => 'Эта технология занимается изучением более новых возможностей большего энергоснабжения щитов, что делает их эффективней и устойчивей. Благодаря этому с каждым изученным уровнем эффективность щитов повышается на 10%.',
111 => 'Специальные сплавы улучшают броню космических кораблей. Так, устойчивость брони может увеличиваться с каждым уровнем на 10%. ',
113 => 'Энергетическая технология занимается дальнейшим развитием систем передачи и хранения энергии, которые необходимы для многих новых технологий.',
114 => 'Путём сплетения 4-го и 5-го измерения стало возможным исследовать новый более экономный и эффективный двигатель.',
115 => 'Дальнейшее развитие этих двигателей делает некоторые корабли быстрее, однако каждый уровень повышает скорость лишь на 10%.',
117 => 'Импульсный двигатель основывается на принципе отдачи. Дальнейшее развитие этих двигателей делает некоторые корабли быстрее, однако с каждым уровнем повышает скорость лишь на 20%. ',
118 => 'Благодаря пространственно-временному изгибу в непосредственном окружении корабля пространство сжимается, чем быстрее преодолеваются далёкие расстояния. Чем выше развит гиперпростраственный привод, тем выше сжатие пространства, благодаря чему с каждым уровнем скорость кораблей повышается на 30%. ',
120 => 'Благодаря фокусированию света возникает луч, который при попадании на объект наносит ему повреждения.',
121 => 'Поистине смертоносный наводимый луч из ускоренных ионов. При попадании на какой-либо объект они наносят огромный ущерб.',
122 => 'Дальнейшее развитие ионной технологии, которая ускоряет не ионы, а высокоэнергетическую плазму. Она оказывает опустошительное действие при попадании на какой-либо объект.',
123 => 'Эта сеть делает возможным общение учёных, работающих в исследовательских лабораториях разных планет. Каждый новый уровень позволяет присоединить к сети дополнительную лабораторию.',
124 => 'Теперь корабли можно оснащать исследовательским модулем, обеспечивающим обработку собранных данных в условиях длительных полётов.',
131 => 'Благодаря передовым разработкам в сфере добычи металла, её возможно увеличить на 2% с каждым уровнем.',
132 => 'Благодаря передовым разработкам в сфере добычи кристалла, её возможно увеличить на 2% с каждым уровнем.',
133 => 'Благодаря передовым разработкам в сфере добычи дейтерия, её возможно увеличить на 2% с каждым уровнем.',
199 => 'Гравитон - это частица, которая не обладает ни массой ни зарядом и определяет силу притяжения. Путём запуска концентрированного заряда гравитонов можно создавать искусственное гравитационное поле, которое, подобно чёрной дыре, втягивает в себя массу, благодаря чему можно уничтожать корабли или даже луны.',

202 => 'Малый транспорт - это манёвренный корабль, который может быстро транспортировать сырьё на другие планеты.',
203 => 'Дальнейшее развитие малых транспортов позволило создать корабли, обладающие большей вместительностью и, благодаря более развитому двигателю, способными передвигаться быстрее, чем малый транспорт, до тех пор, пока на малых транспортах не устанавливаются импульсные двигатели 5-го уровня',
204 => 'Лёгкий истребитель - это манёвренный корабль, который можно найти почти на каждой планете. Затраты на него не особо велики, однако щитовая мощность и вместимость очень малы.',
205 => 'Дальнейшее развитие лёгкого истребителя, он лучше защищён и обладает большей силой атаки.',
206 => 'Крейсеры почти втрое сильней защищены, чем тяжёлые истребители, а по огневой мощи они превосходят тяжёлые истребители почти в два раза. К тому же они очень быстры.',
207 => 'Линкоры как правило составляют основу флота. Их тяжёлые орудия, высокая скорость и большой грузовой тоннаж делают их серьёзными противниками.',
208 => 'При помощи этого корабля можно осваивать незаселённые планеты.',
209 => 'С помощью переработчика добывается сырьё из обломков.',
210 => 'Шпионские зонды - это маленькие манёвренные корабли, которые доставляют с больших расстояний данные о флотах и планетах.',
211 => 'Бомбардировщик был разработан специально для того, чтобы уничтожать планетарную защиту.',
212 => 'Солнечные спутники - это простые платформы из солнечных батарей, которые находятся на высокой орбите. Они собирают солнечный свет и передают его с помощью лазера на наземную станцию. ',
213 => 'Уничтожитель - король среди военных кораблей.',
214 => 'Звезда смерти оснащена гигантской гравитонной пушкой, которая может уничтожать корабли и даже луны.',
215 => 'Линейный крейсер специализируется на перехвате вражеских флотов.',
216 => 'Сверхнова - Самый мощный Императорский боевой корабль',
217 => 'Дальнейшая разработка большого транспорта, более вместительного и быстрого.',
218 => 'При виде этого корабля, жители впадают в ужас и покидают колонии. Прекрасные боевые качества, но ОЧЕНЬ медленный.',
219 => 'Инженеры разработали новый переработчик, он летает быстрее и может собрать значительно больше осколков.',
220 => 'После долгих  лет исследования темной материи(ТМ) ученые научились добывать её из Луны.',
221 => 'Этот корабль является одним из самых мощных кораблей во вселенной. Тэррор спроектирован на с учетом всех имеющихся новых технологий, базовый акцент поставлен на Гравитационной технологии, вследствие чего достигается высокая скорость передвижения и большая огневая мощь. Тем кто выжил поле встречи с Тэррором, приходилось долго восстанавливать свое психологическое состояние . Его щиты способны поглотить практически все виды атак.',
222 => 'Этот корабль является результатом многолетних исследований. Все императоры собрались вместе, чтобы создать это разрушительное чудовище. Он оснащен самыми мощными лазерами и пушками, включая гравитационные пушки, он может уничтожить сотни спутников за нескольо секунд, а их останки в собрать в гигантский склад. ', 
223 => 'Ученые много лет изучали радиоактивное излучение звезд, что бы построить могучий "Звездный ловец". Использование первого класса брони и щитов, класса крейсер, помогает ему выжить при использовании против него гравитационной пушки.',
224 => 'Этот корабль оснащен лучшим ракетным снаряжением и оружием галактики. Огромная огневая мощь превосходит почти все известные аналоги. Колоссальная огневая мощь достигается за счет скорострельности, порядка 500 млрд. выстрелов в минуту, чему даже самая лучшая броня корабля противника не будет рада. Это один из 5 титанов во вселенной.',
225 => 'Этот корабль оснащен лучшим лазерным и ионным оружием галактики, но не имеет ракетных орудий. Мощный лазер превосходит почти все, известные аналоги. Основную ставку ученые сделали на преломлениях и фокусировке света, которая способна придать лучу разрушительную силу, и делает не эффективным использование практически любого щита. Это один из 5 титанов вселенной.',
226 => 'Этот корабль является одним из крупнейших во вселенной грузовых кораблей, Огромные трюмы способны транспортировать порой целую колонию вместе со всеми фабриками и заводами. Он также оснащен очень мощными щитами, что также хорошо для защиты планеты. Однако сила атаки недостаточная. Это один из 5 титанов вселенной.',
227 => 'Лучший боевой корабль существует. Скорость и маневренность - это эго главное оружие. Это один из 5 титанов вселенной.',
228 => 'Этот корабль всего лишь в 4 раза больше человека и поэтому может легко проникать во вражеские форты и разрушить их изнутри. Его скорость не имеет себе равных. Это один из 5 титанов вселенной.',

401 => 'Ракетная установка - простое и дешёвое средство обороны.',
402 => 'При помощи концентрированного обстрела цели фотонами можно достичь значительно больших разрушений, чем при применении обычного баллистического вооружения.',
403 => 'Тяжёлый лазер представляет собой дальнейшее развитие лёгкого лазера.',
404 => 'Пушка Гаусса ускоряет многотонные заряды с гигантскими затратами энергии.',
405 => 'Ионное орудие направляет на цель волну ионов, которая дестабилизирует щиты и повреждает электронику.',
406 => 'Плазменные орудия выпускают сгустки высокотемпературной плазмы и превосходят по своему разрушительному действию даже уничтожитель.',
407 => 'Малый щитовой защищает планету и поглощает удары атаки.',
408 => 'Дальнейшее развитие малого щитового купола. Он может сдерживать ещё более сильные атаки на планету, поглощая значительно большее количество энергии.',
409 => 'Самая мощная защита для ваших планет от вражеского флота',
410 => 'После многолетних исследований в гравитационной технологии, ученым удалось создать гравитационную пушку которая генерирует небольшие концентрированные пучки и атакует ими противника.',
411 => 'Существование орбитальная защитная платформы требует колоссальных затрат энергии, но они с лихвой себя окупают при оборонительных операциях. Она не способна атаковать другие планеты, и находится на орбите в стабильности только под воздействием силы притяжения планеты.',

502 => 'Ракеты-перехватчики уничтожают атакующие межпланетные ракеты.',
503 => 'Межпланетные ракеты уничтожают вражескую оборону.',

601 => 'Геолог - эксперт в астроминералогии и астрокристаллографии. Он окажет помощь вашей команде в Металлургии и химии, а также возьмется за межпланетные коммуникации, чтобы оптимизировать использование и потребление грубой материи на территории всей империи.<br><br><strong><font color="lime">+5% производства. Максимальный уровень: 20</font></strong>',
602 => 'Адмирал флота - опытный ветеран войны и умелый стратег. В самых жестких сражениях, он способен найти выход из ситуации и контактировать с его подчиненными адмиралами. Мудрый император может полагаться на его помощь во время сражений.<br><br><strong><font color="lime">+5% защиты кораблей. Максимальный уровень: 20</font></strong>',
603 => 'Инженер - специалист по управлению энергией. В мирное время, инженер увеличивает энергию на всех колониях империи. В случае атаки, он гарантирует подачу энергии в пушки, предотвращая возможность дополнительной нагрузки, что приводит к сокращению потерянных в сражении единиц орудий защиты.<br><br><strong><font color="lime">+5% к энергии. Максимальный уровень: 10</font></strong>',
604 => 'Профсоюз Технократов состоит из настоящих гениев, Вы всегда найдете их в этом нестабильном мире, где все было бы уничтожено на тысячи осколков перед тем, как Вы смогли бы найти технологическое и рациональное решение. Никакое нормальное человеческое существо не сумеет расшифровывать код технократа. С присутствием технократа в Вашей империи Вы можете забыть о медленном судостроении.<br><br><strong><font color="lime">+5% к скорости строительства кораблей. Максимальный уровень: 10</font></strong>',
605 => 'Конструктор один из лучших строителей. Он способен построить целый город в кратчайшие сроки.<br><br><strong><font color="lime">+10% к скорости построек. Максимальный уровень: 3</font></strong>',
606 => 'Специалист так же входит в профсоюз технократов. Он специализируются в сокращении времени исследований технологий.<br><br><strong><font color="lime">+10% к скорости исследований. Максимальный уровень: 3</font></strong>',
607 => 'Хранитель - из бывшего сообщества планеты Hsac. Его работа заключается в том, чтобы доверенные ему ресурсы не пропадали даром. Его разум позволил придумать выход, он создал новую технику хранения ресурсов.<br><br><strong><font color="lime">+50% к хранилищам. Максимальный уровень: 2</font></strong>',
608 => 'Защитник - член императорской армии. Его заслуга в его работе, которая позволяет ему строить огромную защиту от вражеских флотов в кратчайшие сроки.<br><br><strong><font color="lime">+50% к скорости строительства обороны. Максимальный уровень: 2</font></strong>',
609 => 'Император впечатлен вашей работой, которую Вы предоставляете империи. В качестве благодарности он позволит вам пользоваться самой мощной защитой.<br><br><strong><font color="lime">Возможность строить Планетарный купол</font></strong>',
610 => 'Шпион - загадочный человек. Никто никогда не видел его истинное лицо, если только он не умрет.<br><br><strong><font color="lime">+5 к уровню шпионажа. Максимальный уровень: 2</font></strong>',
611 => 'Командор императорской армии властвовал над искусством управления флотов. Его мозг может вычислять траектории многих флотов, гораздо быстрее, чем мозг обычного человека.<br><br><strong><font color="lime">+3 дополнительных слота к флотам. Максимальный уровень: 3</font></strong>',
612 => 'Разрушитель - служащий без милосердия. Он истребляет все на планетах, только из-за того, что ему это нравится. В настоящее время он разрабатывает новый метод производства Звезд Смерти.<br><br><strong><font color="lime">2 ЗС вместо одной. Максимальный уровень: 1</font></strong>',
613 => 'Почтенный Генерал - человек, который служит много лет в армии. Судостроители повышают производство в его присутствии.<br><br><strong><font color="lime">+25% скорости производства кораблей. Максимальный уровень: 3</font></strong>',
614 => 'Император обнаружил в Вас бесспорные качества завоевателя. Он предлагает Вам стать в Рейдером. Рейдер - самый высокий ранг императорской армии.<br><br><strong><font color="lime">Возможность строить Сверхнову.</font></strong>',
615 => 'Как выяснилось, Вы - великий завоеватель вселенной. Настал момент для того, чтобы Вы взяли место, которое Вы заслуживаете.<br><br><strong><font color="lime">Возможность разрушения планет</font></strong>',

700 => 'Увеличивает параметры атаки кораблей и оборонительных сооружений на %s%%.<br> Этот бонус доступен только на время.',
701 => 'Увеличивает параметры щитов кораблей и оборонительных сооружений на %s%%.<br> Этот бонус доступен только на время.',
702 => 'Уменьшает время постройки зданий на %s%%. <br> Этот бонус доступен только на время.',
703 => 'Увеличивает добываемые ресурсы на  %s%%. <br> Этот бонус доступен только на время.',
704 => 'Увеличивает количество энергии на %s%%. <br> Этот бонус доступен только на время.',
705 => 'Уменьшает время исследований на  %s%%. <br> Этот бонус доступен только на время.',
706 => 'Уменьшает время полета на %s%%. <br> Этот бонус доступен только на время. Не действует на Экспедиции.',
);


// ----------------------------------------------------------------------------------------------------------
// Minen Gebäude
$LNG['info'][1]['name']          			= "Рудник по добыче металла";
$LNG['info'][1]['description']   			= "Основной поставщик сырья для строительства несущих структур построек и кораблей. Металл - самое дешёвое сырьё, но зато его требуется больше, чем всего остального. Для производства металла требуется меньше всего энергии. Чем рудники больше, тем они глубже. На большинстве планет металл находится на больших глубинах, при помощи этих более глубоких рудников можно добывать больше Металлов, производство растёт. В то же время более крупные рудники требуют больше энергии.";
$LNG['info'][2]['name']          			= "Рудник по добыче кристалла";
$LNG['info'][2]['description']   			= "Основной поставщик сырья для электронных строительных элементов и сплавов. Для добычи кристалла требуется примерно вдвое больше энергии, чем для добычи металла, поэтому он, соответственно, ценится больше. Кристалл требуется для всех кораблей и зданий. К сожалению, большинство необходимых для строительства кораблей Кристаллов очень редки и, как и большинство Металлов, залегают на больших глубинах. Поэтому при усовершенствовании рудника также повышается производство, так как осваиваются более крупные и чистые залежи Кристаллов.";
$LNG['info'][3]['name']          			= "Синтезатор дейтерия";
$LNG['info'][3]['description']   			= "Из-за того, что рудники более крупных запасов находятся на дне моря. Усовершенствование синтезатора также способствует освоению этих глубинных залежей дйетерия. Дейтерий необходим в качестве топлива для кораблей, почти для всех исследований, просмотра галактик, а также для использования сенсорной фаланги.";

// ----------------------------------------------------------------------------------------------------------
// Energie Gebäude
$LNG['info'][4]['name']          			= "Солнечная электростанция";
$LNG['info'][4]['description']   			= "Для обеспечения энергией рудников и синтезаторов необходимы огромные солнечные электростанции. Чем больше построено станций, тем больше поверхности покрыто кварцевыми пластинами, которые перерабатывают световую энергию в электроэнергию. Солнечные электростанции представляют собой основу энергообеспечения планеты.";
$LNG['info'][12]['name']         			= "Термоядерная шахта";
$LNG['info'][12]['description']  			= "На термоядерных электростанциях при помощи холодного термоядерного синтеза под огромным давлением и при большой температуре 2 атома тяжёлого водорода объединяются в один атом гелия. При этом, при образовании ядра гелия, вырабатывается энергия в 41,32*10^-13 джоулей в виде излучения (т.о. при сгорании 1 г водорода вырабатывается 172 мВт/ч энергии). Чем больше термоядерный реактор, тем сложнее процессы синтезирования, реактор производит больше энергии";

// ----------------------------------------------------------------------------------------------------------
// Gebäude
$LNG['info'][6]['name']          = "Университет";
$LNG['info'][6]['description']   = "Здесь собираются гениальные умы вашей имперри что бы решать задачи как в теории так и на практике. Уменьшает время исследования на 8% за уровень.";
$LNG['info'][14]['name']         			= "Робофабрика";
$LNG['info'][14]['description']  			= "Предоставляет простую рабочую силу, которую можно применять при строительстве планетарной инфраструктуры. Каждый уровень развития фабрики повышает скорость строительства зданий.";
$LNG['info'][15]['name']         			= "Нанофабрика";
$LNG['info'][15]['description']  			= "Фабрика нанитов представляет собой венец робототехники. Наниты - это роботы размером в нанометр, которые путём объединения в сеть в состоянии выполнять экстраординарные задания. Сразу же после исследования они увеличивают производительность почти во всех областях. С каждым уровнем фабрика нанитов сокращает время строительства зданий, кораблей и оборонительных сооружений вдвое.";
$LNG['info'][21]['name']         			= "Судоверфь";
$LNG['info'][21]['description']  			= "В строительной верфи производятся все виды кораблей и оборонительных сооружений. Чем она больше, тем быстрее можно строить более сложные и более крупные корабли и оборонительные сооружения. Посредством строительства фабрики нанитов производятся миниатюрные роботы, которые помогают работникам работать быстрее.";
$LNG['info'][22]['name']         			= "Хранилище металла";
$LNG['info'][22]['description']  			= "Огромное хранилище для добытых руд. Чем оно больше, тем больше металла можно в нём хранить. Если оно заполнено, то добыча Металла прекращается.";
$LNG['info'][23]['name']         			= "Хранилище кристалла";
$LNG['info'][23]['description']  			= "В этом огромном хранилище складируется ещё не обработанный кристалл. Чем хранилище больше, тем больше Кристалла там можно хранить. Если оно заполнено, то добыча сего ресурса прекращается.";
$LNG['info'][24]['name']         			= "Емкость для дейтерия";
$LNG['info'][24]['description']  			= "Огромные ёмкости для хранения добытого водорода. Они обычно находятся вблизи космических портов. Чем они больше, тем больше водорода в них может сберегаться. Если они заполнены, то добыча водорода прекращается.";
$LNG['info'][31]['name']         			= "Исследовательская лаборатория";
$LNG['info'][31]['description']  			= "Для исследования новых технологий необходима работа исследовательской станции. Уровень развития исследовательской станции является решающим фактором того, как быстро могут быть освоены новые технологии. Чем выше уровень развития исследовательской лаборатории, тем больше может быть исследовано новых технологий. Для того, чтобы как можно быстрее завершить исследовательские работы на одной планете, на неё посылаются все имеющиеся в наличии учёные и, таким образом, покидают свои планеты. Как только технология исследована, учёные возвращаются на свои родные планеты и переносят с собой знания о ней. Так новые технологии можно применять и на других планетах.";
$LNG['info'][33]['name']         			= "Терраформер";
$LNG['info'][33]['description']  			= "По мере застройки планет всё более важным становился вопрос об ограниченности пригодных для использования площадей. Такие традиционные методы, как строительство ввысь и вглубь, оказались недостаточными. Маленькая группа физиков и нанотехников нашла решение - терраформер. <br>Затрачивая огромное количество энергии терраформер может преобразовывать огромные территории и даже целые континенты, делая их пригодными для застройки.<br>В этом строении беспрерывно производятся специальные наниты, отвечающие за постоянное качество почвы.";
$LNG['info'][34]['name']         			= "Склад альянса";
$LNG['info'][34]['description']  			= "Склад альянса предоставляет возможность обеспечения топливом дружественных флотов, которые помогают при обороне и находятся на орбите. С каждым уровнем развития можно посылать флотам на орбите дополнительно 10 000 единиц водорода в час.";

// ----------------------------------------------------------------------------------------------------------
// Mond Gebäude
$LNG['info'][41]['name']         			= "Лунная база";
$LNG['info'][41]['description']  			= "Луна не располагает атмосферой, поэтому перед заселением требуется соорудить лунную базу. Она обеспечивает необходимые воздух, гравитацию и тепло. Чем выше уровень развития лунной базы, тем больше обеспеченная биосферой площадь. Каждый уровень лунной базы может застроить 3 поля, максимум до площади всей луны. Она составляет 2 (диаметр луны/1000), причём каждый уровень лунной базы сам занимает одно поле.";
$LNG['info'][42]['name']         			= "Сенсорная фаланга";
$LNG['info'][42]['description']  			= "Высокочастотные сенсоры полностью просматривают спектр частот всех попадающих на фалангу излучений. Мощные компьютеры комбинируют мельчайшие колебания энергии и таким образом получают информацию о передвижениях кораблей на отдалённых планетах. Для просмотра на луне должна быть предоставлена энергия в форме водорода (5 000 за просмотр). Просмотр осуществляется переходом с луны в меню Галактика и на название вражеской планеты, находящейся в радиусе действия сенсоров (формула: (уровень фаланги)^2-1 систем).";
$LNG['info'][43]['name']         			= "Телепорт";
$LNG['info'][43]['description']                        = "Телепорт - это огромные врата, которые могут пересылать между собой флоты любых размеров без временных затрат. Эти телепортеры не требуют дейтерия, однако между двумя прыжками должен пройти один час, иначе ворота перегреются. Невозможна также пересылка ресурсов. Весь процесс требует крайне высоко развитой технологии.";
$LNG['info'][44]['name']                               = "Ракетная шахта";
$LNG['info'][44]['description']                        = "Ракетные шахты служат для хранения ракет. С каждым уровнем можно хранить на пять межпланетных или десять ракет-перехватчиков больше. Одна межпланетная ракета требует места в два раза больше, чем ракета-перехватчик. Возможно любое комбинирование различных типов ракет.";

// ----------------------------------------------------------------------------------------------------------
// Forschung
$LNG['info'][106]['name']        = 'Технология шпионажа';
$LNG['info'][106]['description'] = "Шпионаж предназначен для исследования новых и более эффективных сенсоров. Чем выше развита эта технология, тем больше информации имеет игрок о событиях в своём окружении. Разница в уровнях шпионажа с противником играет решающую роль - чем больше исследована собственная шпионская технология, тем больше информации содержится в разведданных и тем меньше шанс быть обнаруженным. Чем больше послано зондов, тем больше собирается подробностей о противнике, но при этом растёт опасность быть обнаруженным. Также шпионаж совершенствует определение местонахождения чужих флотов. При этом также важен уровень развития собственного шпионажа.";
$LNG['info'][108]['name']        = "Компьютерная технология";
$LNG['info'][108]['description'] = "Компьютерная технология предназначена для расширения имеющихся в наличии компьютерных мощностей. В результате на планете развиваются более продуктивные и эффективные компьютерные системы, возрастает вычислительная мощность и скорость протекания вычислительных процессов. С повышением мощности компьютеров можно одновременно командовать всё большим количеством флотов. Каждый уровень развития компьютерной технологии даёт возможность командовать +1 флотом. Чем больше рассылается флотов, тем больше можно совершать налётов и тем самым захватывать больше сырья. Естественно, что эта технология полезна и торговцам, так как она позволяет им одновременно рассылать больше торговых флотов. По этой причине следует постоянно развивать компьютерную технологию на протяжении всей игры..";
$LNG['info'][109]['name']        = "Оружейная технология";
$LNG['info'][109]['description'] = "Оружейная технология занимается прежде всего дальнейшим развитием имеющихся в наличии систем вооружения. При этом особое значение придаётся тому, чтобы снабжать имеющиеся в наличии системы большей энергией и более точно эту энергию направлять. Благодаря этому системы вооружения становятся эффективней, а оружие вызывает больше разрушений. Каждый уровень оружейной технологии увеличивает мощность вооружения войсковых частей на 10%. Оружейная технология важна для конкурентоспособного содержания частей. Поэтому следовало бы её постоянно развивать в течение всей игры.";
$LNG['info'][110]['name']        = "Щитовая технология";
$LNG['info'][110]['description'] = "Эта технология занимается изучением более новых возможностей большего энергоснабжения щитов, что делает их эффективней и устойчивей. Благодаря этому с каждым изученным уровнем эффективность щитов повышается на 10%.";
$LNG['info'][111]['name']        = "Технология брони космических кораблей";
$LNG['info'][111]['description'] = "Специальные сплавы улучшают броню космических кораблей. Как только найден очень стойкий сплав, специальные лучи изменяют молекулярную структуру космического корабля, и доводит её до состояния изученного сплава. Так, устойчивость брони может увеличиваться с каждым уровнем на 10%.";
$LNG['info'][113]['name']        = "Энергетическая технология";
$LNG['info'][113]['description'] = "Энергетическая технология занимается дальнейшим развитием систем передачи и хранения энергии, которые необходимы для многих новых технологий.";
$LNG['info'][114]['name']        = "Гиперпространственная технология";
$LNG['info'][114]['description'] = "Путём сплетения 4-го и 5-го измерения стало возможным исследовать новый более экономный и эффективный двигатель.";
$LNG['info'][115]['name']        = "Технология реактивных двигателей";
$LNG['info'][115]['description'] = "В основе реактивного двигателя лежит закон сохранения импульса. Материя, разогретая до высоких температур, выбрасывается в направлении, противоположном движению и даёт ускорение кораблю. Эффективность этих двигателей достаточно мала, но они достаточно надёжны, дёшевы в производстве и обслуживании. Кроме того они занимают гораздо меньше места на корабле по сравнению с остальными двигателями, поэтому их всё ещё достаточно часто можно встретить на маленьких кораблях. Так как реактивные двигатели являются основой любого полёта в космос, следует исследовать их как можно раньше. Дальнейшее развитие этих двигателей делает следующие корабли с каждым уровнем на 10% быстрее: малые и большие транспорты, лёгкие истребители и шпионские зонды.";
$LNG['info'][117]['name']        = "Технология импульсных двигателей";
$LNG['info'][117]['description'] = "Импульсный двигатель основывается на принципе отдачи, при котором возникает масса лучей, по большей части в виде побочного продукта ядерного синтеза, использованного для получения энергии. Также можно впрыснуть дополнительную массу. Дальнейшее развитие этих двигателей делает следующие корабли с каждым уровнем на 20% быстрее: бомбардировщики, крейсеры, тяжёлые истребители и колонизаторы. Каждый уровень развития увеличивает радиус действия межпланетных ракет.";
$LNG['info'][118]['name']        = "Технология гиперпространственных двигателей";
$LNG['info'][118]['description'] = "Благодаря пространственно-временному изгибу в непосредственном окружении корабля пространство сжимается, чем быстрее преодолеваются далёкие расстояния. Чем выше развит гиперпространственный привод, тем выше сжатие пространства, благодаря чему с каждым уровнем скорость кораблей повышается на 30%.";
$LNG['info'][120]['name']        = "Лазерная технология";
$LNG['info'][120]['description'] = "Лазеры (усиление света при помощи индуцированного выброса излучения) производят насыщенный энергетический луч когерентного света. Эти приборы находят применение во всевозможных областях, от оптических компьютеров до тяжёлых лазеров, которые свободно режут броню космических кораблей. Лазерная технология является важным элементом для исследования дальнейших оружейных технологий.";
$LNG['info'][121]['name']        = "Ионная технология";
$LNG['info'][121]['description'] = "Поистине смертоносный наводимый луч из ускоренных ионов. При попадании на какой-либо объект они наносят огромный ущерб.";
$LNG['info'][122]['name']        = "Плазменная технология";
$LNG['info'][122]['description'] = "Дальнейшее развитие ионной технологии, которая ускоряет не ионы, а высокоэнергетическую плазму. Она оказывает опустошительное действие при попадании на какой-либо объект.";
$LNG['info'][123]['name']        = "Межгалактическая исследовательская сеть";
$LNG['info'][123]['description'] = "Эта сеть делает возможным общение учёных, работающих в исследовательских лабораториях разных планет. Каждый новый уровень позволяет присоединить к сети дополнительную лабораторию (в первую очередь присоединяются лаборатории старших уровней). Из всех объединённых в сеть лабораторий, в каждом исследовании принимают участие только те, которые имеют достаточный для проведения данного исследования уровень. Скорость исследования соответствует сумме уровней участвующих в нём лабораторий.";
$LNG['info'][124]['name']        = "Экспедиционная технология";
$LNG['info'][124]['description'] = "Экспедиционная технология охватывает различные технологии сканирования и даёт возможность оснащать корабли различных классов исследовательским модулем. Он содержит базу данных, маленькую передвижную лабораторию, а также различные биоклетки и сосуды для проб. Для безопасности корабля при исследовании опасных объектов исследовательский модуль оснащён автономным энергообеспечением и генератором энергетического поля, который в экстремальных ситуациях может окружать исследовательский модуль мощным энергетическим полем.";
$LNG['info'][131]['name']        = 'Улучшенная добыча металла';
$LNG['info'][131]['description'] = 'Благодаря передовым разработкам в сфере добычи металла, её возможно увеличить на 2% с каждым уровнем.';
$LNG['info'][132]['name']        = 'Улучшенная добыча кристаллов';
$LNG['info'][132]['description'] = 'Благодаря передовым разработкам в сфере добычи кристалла, её возможно увеличить на 2% с каждым уровнем.';
$LNG['info'][133]['name']        = 'Улучшенная добыча дейтерия';
$LNG['info'][133]['description'] = 'Благодаря передовым разработкам в сфере добычи дейтерия, её возможно увеличить на 2% с каждым уровнем.';
$LNG['info'][199]['name']        = 'Гравитационная технология';
$LNG['info'][199]['description'] = 'Гравитон - это частица, которая не обладает ни массой ни зарядом и определяет силу притяжения. Путём запуска концентрированного заряда гравитонов можно создавать искусственное гравитационное поле, которое, подобно чёрной дыре, втягивает в себя массу, благодаря чему можно уничтожать корабли или даже луны. Чтобы произвести достаточное количество гравитонов, требуются огромные количества энергии.';

// ----------------------------------------------------------------------------------------------------------
// Schiffe
$LNG['info'][202]['name']        = "Малый транспорт";
$LNG['info'][202]['description'] = "Транспорты имеют примерно такой же размер, что и истребители, но они не обладают мощными двигателями и бортовым вооружением ради экономии места. Малый транспорт вмещает 5000 единиц сырья. По причине малой огневой мощи малые транспорты часто сопровождаются другими кораблями.";
$LNG['info'][203]['name']        = "Большой транспорт";
$LNG['info'][203]['description'] = "У этого корабля нет ни вооружения, ни каких-либо других технологий на борту. По этой причине никогда не следует запускать их без сопровождения. Благодаря своему высокоразвитому двигателю внутреннего сгорания большой транспорт служит в качестве быстрого межпланетного доставщика ресурсов, также он сопровождает флоты при нападениях на вражеские планеты, чтобы захватить как можно больше ресурсов.";
$LNG['info'][204]['name']        = "Лёгкий истребитель";
$LNG['info'][204]['description'] = "Лёгкий истребитель - это манёвренный корабль, который можно найти почти на каждой планете. Затраты на нем не особо велики, однако щитовая мощность и вместимость очень малы.";
$LNG['info'][205]['name']        = "Тяжёлый истребитель";
$LNG['info'][205]['description'] = "При дальнейшем развитии лёгкого истребителя учёные дошли до момента, когда стало ясно, что обыкновенный двигатель не обладает необходимой мощью. Для того, чтобы оптимально передвигать корабль был впервые использован импульсный двигатель. Хоть он и повысил стоимость, однако он также открыл новые возможности. Благодаря применению этого двигателя осталось больше энергии для вооружения и щитов, кроме того, для этого вида истребителей также использовались ценные материалы. Это привело к улучшенной структурной целостности и более сильной огневой мощи, благодаря чему в бою он представляет большую угрозу, чем его предшественник. После этих изменений тяжёлый истребитель представляет собой новую эру технологии кораблестроения, основу технологии крейсеростроения.";
$LNG['info'][206]['name']        = "Крейсер";
$LNG['info'][206]['description'] = "С развитием тяжёлых лазеров и ионных пушек тяжёлые истребители всё больше вытеснялись. Несмотря на многочисленные усовершенствования огневая мощь и бронирование не могли быть настолько изменены, чтобы действенно противостоять этим оборонительным орудиям. Поэтому было решено построить новый класс кораблей, который объединял бы в себе больше бронирования и огневой мощи. Так появился крейсер. Крейсеры почти втрое сильней защищены, чем тяжёлые истребители и обладают более чем удвоенной огневой мощью. К тому же они очень быстры. Нет лучшего оружия против средней защиты. Почти столетие крейсеры неограниченно господствовали во вселенной. С появлением орудий Гаусса и плазменных орудий их господство закончилось. Однако и сегодня их охотно применяют против групп истребителей. <br>У крейсера есть скорострел (10) против реактивного гранатомёта и (3) против лёгких истребителей, т.е. один крейсер уничтожает одним выстрелом несколько реактивных гранатомётов и, соответственно, лёгких истребителей.";
$LNG['info'][207]['name']        = "Линкор";
$LNG['info'][207]['description'] = "Линкоры как правило составляют основу флота. Их тяжёлые орудия, высокая скорость и большой грузовой тоннаж делают их серьёзными противниками.";
$LNG['info'][208]['name']        = "Колонизатор";
$LNG['info'][208]['description'] = "Этот хорошо защищённый корабль служит покорению новых планет, что необходимо развивающейся империи. Он используется в новой колонии в качестве поставщика сырья - его разбирают и используют весь полезный материал для освоения нового света. Каждая империя, включая главную планету, может колонизировать максимум 9 планет.";
$LNG['info'][209]['name']        = "Переработчик";
$LNG['info'][209]['description'] = "Космические бои принимали всё большие масштабы. Уничтожались тысячи кораблей и возникавшие при этом обломки казались навсегда потерянными. Нормальные транспорты не могли близко к ним приблизиться, не будучи сильно повреждёнными маленькими обломками. С новым открытием в области щитовой технологии стало возможно эффективно устранять эту проблему, возник новый класс корабля, подобный большому транспорту - переработчик. С его помощью можно было заново использовать казавшиеся потерянными ресурсы. Из-за новых щитов маленькие обломки больше не представляли собой опасности. К сожалению, эти устройства требуют пространства, поэтому его грузовой тоннаж ограничен до 20 000.";
$LNG['info'][210]['name']        = "Шпионский зонд";
$LNG['info'][210]['description'] = "Шпионские зонды - это маленькие манёвренные корабли, которые доставляют с больших расстояний данные о флотах и планетах. Их высокомощный двигатель позволяет им преодолевать большие расстояния за несколько секунд. Однажды попав на орбиту какой-нибудь планеты, они пребывают там некоторое время для сборки данных. В это время враг может их относительно легко обнаружить и атаковать. Для экономии места не было установлено ни брони, ни щитов, ни орудий, что делает зонды в случае обнаружения лёгкими целями.";
$LNG['info'][211]['name']        = "Бомбардировщик";
$LNG['info'][211]['description'] = "Бомбардировщик был разработан специально для того, чтобы уничтожать планетарную защиту. С помощью лазерного прицела он точно сбрасывает плазменные бомбы на поверхность планеты и таким образом наносит огромные повреждения оборонительным сооружениям. Скорострел против реактивного гранатомёта(10), лёгких (10) и тяжёлых лазерных орудий (5), а также против ионных орудий (5).";
$LNG['info'][212]['name']        = "Солнечный спутник";
$LNG['info'][212]['description'] = "Солнечные спутники запускаются на орбиту планеты. Они фокусируют солнечную энергию и передают её на наземную станцию. Эффективность солнечных спутников зависит от мощи солнечного излучения. В принципе, добыча энергии на орбитах, более приближённых к солнцу, выше, чем на планетах, удалённых от солнца. Из-за своего соотношения цены и качества солнечные спутники решают энергетические проблемы многих миров. Но внимание: солнечные спутники могут быть уничтожены в бою.";
$LNG['info'][213]['name']        = "Уничтожитель";
$LNG['info'][213]['description'] = "Уничтожитель - король среди военных кораблей. Его мультифланговые ионные, плазменные и гауссовые орудийные башни могут благодаря своим усовершенствованным пеленгационным сенсорам поражать с точностью до 99% даже скоростные манёвренные истребители. Так как уничтожители очень велики, их манёвренность очень ограничена, и в бою они подобны скорее боевой станции, чем боевому кораблю. Потребление дейтерия у них так же высоко, как и их боевая мощь. У разрушителя есть скорострел (10) против лёгкого лазера, т.е. один уничтожитель уничтожает несколько лёгких лазеров одним выстрелом.";
$LNG['info'][214]['name']        = "Звезда смерти";
$LNG['info'][214]['description'] = "Звезда смерти оснащена гравитонной пушкой, которая может уничтожать такие корабли, как уничтожитель, и даже луны. Так как для этого требуется большое количество энергии, она состоит почти лишь из генераторов. Только огромные звёздные империи могут вообще предоставить ресурсы и работников, чтобы построить этот размером с луну корабль.";
$LNG['info'][215]['name']        = "Линейный крейсер";
$LNG['info'][215]['description'] = "Этот высокотехнологичный корабль несёт смерть атакующим флотам. Его усовершенствованные лазерные орудия удерживают тяжёлые корабли противника на расстоянии и могут уничтожать несколько единиц одним залпом. За счёт его малых размеров и невероятно мощного вооружения, грузоподъёмность линейного крейсера очень мала, но за счёт гиперпространственного двигателя также мало потребление топлива.";
$LNG['info'][216]['name']        = "Супернова";
$LNG['info'][216]['description'] = "Вам предоставляется вознаграждение со стороны императора за ваши навыки жестокости.";
$LNG['info'][217]['name']        = 'Улучшенный транспорт';
$LNG['info'][217]['description'] = 'Дальнейшая разработка большого транспорта, более вместительного и быстрого.';
$LNG['info'][218]['name']        = 'Аватар';
$LNG['info'][218]['description'] = 'При виде этого корабля, жители впадают в ужас и покидают колонии. Прекрасные боевые качества, но ОЧЕНЬ медленный.';
$LNG['info'][219]['name']        = 'Мага переработчик';
$LNG['info'][219]['description'] = 'Инженеры разработали новый переработчик, он летает быстрее и может собрать значительно больше осколков.';
$LNG['info'][220]['name']        = 'Межгалактический сборщик ТМ';
$LNG['info'][220]['description'] = 'После долгих  лет исследования темной материи(ТМ) ученые научились добывать её из Луны.';
$LNG['info'][221]['name']        = 'Тэррор';
$LNG['info'][221]['description'] = 'Этот корабль является одним из самых мощных кораблей во вселенной. Тэррор спроектирован на с учетом всех имеющихся новых технологий, базовый акцент поставлен на Гравитационной технологии, вследствие чего достигается высокая скорость передвижения и большая огневая мощь. Тем кто выжил поле встречи с Тэррором, приходилось долго восстанавливать свое психологическое состояние . Его щиты способны поглотить практически все виды атак.';
$LNG['info'][222]['name']        = 'Бегемот';
$LNG['info'][222]['description'] = 'Этот корабль является результатом многолетних исследований. Все императоры собрались вместе, чтобы создать это разрушительное чудовище. Он оснащен самыми мощными лазерами и пушками, включая гравитационные пушки, он может уничтожить сотни спутников за нескольо секунд, а их останки в собрать в гигантский склад.';
$LNG['info'][223]['name']        = 'Звездный ловец';
$LNG['info'][223]['description'] = 'Ученые много лет изучали радиоактивное излучение звезд, что бы построить могучий "Звездный ловец". Использование первого класса брони и щитов, класса крейсер, помогает ему выжить при использовании против него гравитационной пушки.';
$LNG['info'][224]['name']        = 'Звездный Титан Ифрит';
$LNG['info'][224]['description'] = 'Этот корабль оснащен лучшим ракетным снаряжением и оружием галактики. Огромная огневая мощь превосходит почти все известные аналоги. Колоссальная огневая мощь достигается за счет скорострельности, порядка 500 млрд. выстрелов в минуту, чему даже самая лучша броня корабля противника не будет рада. Это один из 5 титанов во вселенной.';
$LNG['info'][225]['name']        = 'Звездный Титан Шива';
$LNG['info'][225]['description'] = 'Этот корабль оснащен лучшим лазерным и ионным оружием галактики, но не имеет ракетных орудий. Мощный лазер превосходит почти все, известные аналоги. Основную ставку ученые сделали на преломлениях и фокусировке света, которая способна придать лучу разрушительную силу, и делает неэффективным использование практически любого щита. Это один из 5 титанов вселенной.';
$LNG['info'][226]['name']        = 'Звездный Титан Кентавр';
$LNG['info'][226]['description'] = 'Этот корабль является одним из крупнейших во вселенной грузовых кораблей, Огромные трюмы способны транспортировать порой целую колонию вместе со всеми фабриками и заводами. Он также оснащен очень мощными щитами, что также хорошо для защиты планеты. Однако сила атаки недостаточная. Это один из 5 титанов вселенной.';
$LNG['info'][227]['name']        = 'Звездный Титан Эпсилон';
$LNG['info'][227]['description'] = 'Лучший боевой корабль существует. Скорость и маневренность - это эго главное оружие. Это один из 5 титанов вселенной.';
$LNG['info'][228]['name']        = 'Звездный Титан Один';
$LNG['info'][228]['description'] = 'Этот корабль всего лишь в 4 раза больше человека и поэтому может легко проникать во вражеские форты и разрушить их изнутри. Его скорость не имеет себе равных. Это один из 5 титанов вселенной.';


// ----------------------------------------------------------------------------------------------------------
// Verteidigung
$LNG['info'][401]['name']        = "Ракетная установка";
$LNG['info'][401]['description'] = "Ракетная установка - простое и дешёвое средство обороны. Так как это развитие обычных баллистических орудий, то ему не требуется дальнейшей модернизации. Малые затраты на его производство оправдывают его применение против более маленьких флотов, но со временем он теряет значение. Позднее его используют лишь для отвода вражеских выстрелов. Оборонительные сооружения деактивируются сами по себе, как только они сильно повреждаются. Возможность восстановления оборонительных сооружений после боя составляет до 70%.";
$LNG['info'][402]['name']        = "Лёгкий лазер";
$LNG['info'][402]['description'] = "Для компенсации чрезмерных успехов в области технологии космических кораблей учёные должны были создать оборонительное сооружение, справляющееся с более крупными и лучше вооружёнными флотами. Это привело к появлению рождение лёгкого лазера. При помощи концентрированного обстрела цели фотонами можно достичь значительно больших разрушений, чем при применении обычного баллистического вооружения. Для противостояния более сильной огневой мощи новых типов кораблей он также оснащён усовершенствованными щитами. Однако, чтобы стоимость производства оставалась низкой, структура дальше не усиливалась. Лёгкий лазер обладает наилучшим соотношением цены и качества, поэтому он также интересен и для более развитых цивилизаций. Оборонительные сооружения деактивируются сами по себе, как только они сильно повреждаются. Возможность восстановления оборонительных сооружений после боя составляет до 70%.";
$LNG['info'][403]['name']        = "Тяжёлый лазер";
$LNG['info'][403]['description'] = "Тяжёлый лазер представляет собой дальнейшее развитие лёгкого лазера. Структура была усилена и усовершенствована новыми материалами. Оболочку смогли сделать значительно более стойкой. Одновременно была улучшена и энергетическая система и целевой компьютер, так что тяжёлый лазер может концентрировать значительно больше энергии на цели. Оборонительные сооружения деактивируются сами по себе, как только они сильно повреждаются. Возможность восстановления оборонительных сооружений после боя составляет до 70%.";
$LNG['info'][404]['name']        = "Пушка Гаусса";
$LNG['info'][404]['description'] = "Долгое время артиллерийские орудия считались устаревшими по сравнению с современной ядерной и энергетической техникой, развитием гиперпространственного привода и постоянно улучшающимися бронировками, пока именно энергетическая техника, которая их когда-то оттесняла, не помогла им занять их исконное место. Вообще-то принцип ускорителя частиц был известен на Земле уже с 20-го и 21-го столетий. Пушка Гаусса - это ничто иное, как значительно большая версия этой конструкции. Многотонные заряды магнетически ускоряются при огромных затратах энергии и имеют такую выходную скорость, что частички грязи в воздухе вокруг заряда сгорают, а отдача сотрясает землю. Даже современные бронировки и щиты могут с трудом противостоять этой пробивной силе, и нередко случается так, что цель просто простреливается насквозь. Оборонительные сооружения деактивируются сами по себе, как только они сильно повреждаются. Возможность восстановления оборонительных сооружений после боя составляет до 70%.";
$LNG['info'][405]['name']        = "Ионное орудие";
$LNG['info'][405]['description'] = "В 21-м столетии на Земле уже существовало то, что общеизвестно как ЭМИ. ЭМИ означает электромагнитный импульс, который обладает способностью индуцировать дополнительные напряжения в схемы и тем самым причинять массовые помехи, которые могут уничтожить все чувствительные приборы. Тогда ЭМИ-орудия были в основном на базе ракет и бомб, также в комбинации с ядерными орудиями. Между тем ЭМИ постоянно развивался, так как в нём видели большой потенциал не уничтожать цели, а делать их неспособными к бою и манёвренности и, тем самым, упрощать их захват. Пока что наивысшая форма ЭМИ-орудий представлена ионным орудием. Оно направляет на цель волну ионов (электрически заряженных частиц), которая дестабилизирует щиты и повреждает электронику, только если она не очень хорошо защищена, что иногда подобно полному уничтожению. Кинетической пробивной силой можно пренебречь. Ионная техника используется только на крейсерах, так как потребление энергии ионными орудиями огромно, и в бою часто приходится уничтожить, а не парализовать цель. Оборонительные сооружения деактивируются сами по себе, как только они сильно повреждаются. Возможность восстановления оборонительных сооружений после боя составляет до 70%.";
$LNG['info'][406]['name']        = "Плазменное орудие";
$LNG['info'][406]['description'] = "Лазерная технология была доведена до совершенства, ионная техника достигла конечной стадии и считалось, что практически невозможно, даже с качественной точки зрения орудийной системы, достичь ещё больше эффективности. Но всё должно было измениться, когда появилась идея объединить обе системы. Из термоядерной технологии известно, что лазеры нагревают частицы (обычно дейтерия) до крайне высоких температур, исчисляемых в миллионах градусов. Ионная техника обогащает их электрическим зарядом, стабилизационными полями и ускорителями. Как только заряд достаточно нагрет, ионизирован и находится под давлением, то его выпускают посредством ускорителей во вселенские дали в направлении цели. Светящийся голубоватым цветом плазменный шар выглядит внушительно, только спрашивается, долго ли им будет наслаждаться команда корабля-цели, если через несколько секунд броня разорвётся на куски, а электроника сгорит... Плазменное орудие считается вообще самым страшным оружием, и у этой техники есть своя цена. Оборонительные сооружения деактивируются сами по себе, как только они сильно повреждаются. Возможность восстановления оборонительных сооружений после боя составляет до 70%.";
$LNG['info'][407]['name']        = "Малый купол";
$LNG['info'][407]['description'] = "Задолго до того, как щитовые генераторы были достаточно малы, чтобы найти применение на кораблях, уже существовали огромные генераторы на поверхности планет. Они обволакивали целую планету силовым полем, которое могло поглощать удары атаки. Малые атакующие флоты постоянно разбиваются об эти купола. Благодаря растущему технологическому развитию эти щиты можно ещё усилить. Позже можно строить более сильный большой купол. На каждой планете можно построить только один малый купол.";
$LNG['info'][408]['name']        = "Большой купол";
$LNG['info'][408]['description'] = "Дальнейшее развитие малого купола. Он может сдерживать ещё более сильные атаки на планету, поглощая значительно большее количество энергии.";
$LNG['info'][409]['name']        = "Планетарный купол";
$LNG['info'][409]['description'] = "Самая мощная защита для ваших планет от вражеских кораблей.";
$LNG['info'][410]['name']        = 'Гравитационная пушка';
$LNG['info'][410]['description'] = 'После многолетних исследований в гравитационной технологии, ученым удалось создать гравитационную пушку которая генерирует небольшие концентрированные пучки и атакует ими противника.';
$LNG['info'][411]['name']        = 'Защитная орбитальная платформа';
$LNG['info'][411]['description'] = 'Существование орбитальная защитная платформы требует колоссальных затрат энергии, но они с лихвой себя окупают при оборонительных операциях. Она не способна атаковать другие планеты, и находится на орбите в стабильности только под воздействием силы притяжения планеты.';
// ----------------------------------------------------------------------------------------------------------
// Raketen 
$LNG['info'][502]['name']        = "Ракета-перехватчик";
$LNG['info'][502]['description'] = "Ракеты-перехватчики уничтожают атакующие межпланетные ракеты. Одна ракета-перехватчик уничтожает одну межпланетную ракету.";
$LNG['info'][503]['name']        = "Межпланетная ракета";
$LNG['info'][503]['description'] = "Межпланетные ракеты уничтожают защиту противника. Уничтоженные межпланетными ракетами оборонительные сооружения больше не восстанавливаются.";

// ----------------------------------------------------------------------------------------------------------
// Offiziere
$LNG['info'][601]['name']        = "Геолог";
$LNG['info'][601]['description'] = "Геолог - эксперт в астроминералогии и астроКристаллографии. Он окажет помощь вашей команде в Металлургии и химии, а также возьмется за межпланетные коммуникации, чтобы оптимизировать использование и потребление грубой материи на площади всей империи.<br><br>+5% производства. Максимальный уровень: 20";
$LNG['info'][602]['name']        = "Адмирал";
$LNG['info'][602]['description'] = "Адмирал флота - опытный ветеран войны и умелый стратег. В самых жестких сражениях, он способен найти выход из ситуации и контактировать с его подчиненными адмиралами. Мудрый император может полагаться на его помощь во время сражений.<br><br>+5% защиты кораблей. Максимальный уровень: 20";
$LNG['info'][603]['name']        = "Инженер";
$LNG['info'][603]['description'] = "Инженер - специалист по управлению энергией. В мирное время, инженер увеличивает энергию на всех колониях империи. В случае атаки, он гарантирует подачу энергии в пушки, предотвращая возможность дополнительной нагрузки, что приводит к сокращению потерянных в сражении единиц орудий защиты.<br><br>+5% к энергии. Максимальный уровень: 10";
$LNG['info'][604]['name']        = "Технократ";
$LNG['info'][604]['description'] = "Профсоюз Технократов состоит из настоящих гениев, Вы всегда найдете их в этом нестабильном мире, где все было бы уничтожено на тысячи осколков перед тем, как Вы смогли бы найти технологическое и рациональное решение. Никакое нормальное человеческое существо не сумеет расшифровывать код технократа. С присутствием технократа в Вашей империи Вы можете забыть о медленном судостроении.<br><br>+5% к скорости строительства кораблей. Максимальный уровень: 10";
$LNG['info'][605]['name']        = "Конструктор";
$LNG['info'][605]['description'] = "Конструктор один из лучших строителей. Он способен построить целый город в кратчайшие сроки.<br><br>+10% к скорости построек. Максимальный уровень: 3";
$LNG['info'][606]['name']        = "Ученый";
$LNG['info'][606]['description'] = "Ученый так же входит в профсоюз технократов. Он специализируются в сокращении времени исследований технологий.<br><br>+10% к скорости исследований. Максимальный уровень: 3";
$LNG['info'][607]['name']        = "Хранитель";
$LNG['info'][607]['description'] = "Хранитель - из бывшего сообщества планеты Нубару. Его работа заключается в том, чтобы доверенные ему ресурсы не пропадали даром. Его разум позволил придумать выход, он создал новую технику хранения ресурсов.<br><br>+50% к хранилищам. Максимальный уровень: 2";
$LNG['info'][608]['name']        = "Министр обороны";
$LNG['info'][608]['description'] = "Министр обороны - член императорской армии. Его заслуга в его работе заключается в том, что он позволяет строить огромную защиту от вражеских флотов в кратчайшие сроки.<br><br>+50% к скорости строительства обороны. Максимальный уровень: 2";
$LNG['info'][609]['name']        = "Защитник";
$LNG['info'][609]['description'] = "Император впечатлен вашей работой, которую Вы предоставляете империи. В качестве благодарности он позволит вам пользоваться самой мощной защитой.<br><br>Возможность строить Планетарный купол.";
$LNG['info'][610]['name']        = "Шпион";
$LNG['info'][610]['description'] = "Шпион - загадочный человек. Никто никогда не видел его истинное лицо, если только он не умрет.<br><br>+5 к уровню шпионажа. Максимальный уровень: 2";
$LNG['info'][611]['name']        = "Командир";
$LNG['info'][611]['description'] = "Командор императорской армии властвовал над искусством управления флотов. Его мозг может вычислять траектории многих флотов, гораздо быстрее, чем мозг обычного человека.<br><br>+3 дополнительных слота к флотам. Максимальный уровень: 3";
$LNG['info'][612]['name']        = "Разрушитель";
$LNG['info'][612]['description'] = "Разрушитель - служащий без милосердия. Он истребляет все на планетах, только из-за того, что ему это нравится. В настоящее время он разрабатывает новый метод производства Звезд Смерти.<br><br>2 Звезды смерти вместо 1. Максимальный уровень: 1";
$LNG['info'][613]['name']        = "Генерал";
$LNG['info'][613]['description'] = "Почтенный Генерал - человек, который служит много лет в армии. Судостроители повышают производство в его присутствии.<br><br>+25% скорости производства кораблей. Максимальный уровень: 3";
$LNG['info'][614]['name']        = "Рейдер";
$LNG['info'][614]['description'] = "Император обнаружил в Вас бесспорные качества завоевателя. Он предлагает Вам стать в Рейдером. Рейдер - самый высокий ранг императорской армии.<br><br>Возможность строить Сверхновую звезду.";
$LNG['info'][615]['name']        = "Император";
$LNG['info'][615]['description'] = "Как выяснилось, Вы - великий завоеватель вселенной. Настал момент для того, чтобы Вы заняли место, которое Вы заслуживаете.<br><br>Возможность разрушения планет.";

// Translated into Russian by ssAAss . All rights reversed (C) 2010

?>
