<?php

// Короткие названия для боевых докладов
$LNG['tech_rc'] = array (
202 => 'М. трансп.',
203 => 'Б. трансп.',
204 => 'Л. истр.',
205 => 'Т. истр.',
206 => 'Крейсер',
207 => 'Линк.',
208 => 'Колонизатор',
209 => 'Переработчик',
210 => 'Шп. зонд',
211 => 'Бомб.',
212 => 'Солн. спутник',
213 => 'Уничт.',
214 => 'ЗС',
215 => 'Лин. Кр.',
216 => 'Сверхн. звезда',
217 => 'Ул. трансп.',
218 => 'Аватар',
219 => 'Мега перераб.',
220 => 'Сборщик Кв.',

401 => 'РУ',
402 => 'Лёг. лазер',
403 => 'Тяж. лазер',
404 => 'Гаусс',
405 => 'Ион',
406 => 'Плазма',
407 => 'М. купол',
408 => 'Б. купол',
409 => 'П. купол',
410 => 'Гравитонка',
411 => 'Орб. база',
);

$LNG['tech'] = array(
0   => 'Постройки',
1   => 'Рудник металла',
2   => 'Рудник кристалла',
3   => 'Синтезатор дейтерия',
4   => 'Солнечная электростанция',
6   => 'Технополис',
12  => 'Термоядерная электростанция',
14  => 'Фабрика роботов',
15  => 'Фабрика нанитов',
21  => 'Верфь',
22  => 'Хранилище металла',
23  => 'Хранилище кристалла',
24  => 'Ёмкость для дейтерия',
31  => 'Исследовательская лаборатория',
33  => 'Терраформер',
34  => 'Склад альянса',
44  => 'Ракетная шахта',

40  => 'Лунные постройки',
41  => 'Лунная база',
42  => 'Сенсорная фаланга',
43  => 'Телепорт',

// Исследования
100 => 'Исследования',
106 => 'Шпионаж',
108 => 'Компьютерная технология',
109 => 'Оружейная технология',
110 => 'Щитовая технология',
111 => 'Броня космических кораблей',
113 => 'Энергетическая технология',
114 => 'Гиперпространственная технология',
115 => 'Реактивный двигатель',
117 => 'Импульсный двигатель',
118 => 'Гиперпространственный двигатель',
120 => 'Лазерная технология',
121 => 'Ионная технология',
122 => 'Плазменная технология',
123 => 'Межгалактическая исследовательская сеть',
124 => 'Астрофизика',
131 => 'Технология добычи металла',
132 => 'Технология добычи кристалла',
133 => 'Технология добычи дейтерия',
199 => 'Гравитационная технология',

200 => 'Флот',
202 => 'Малый транспорт',
203 => 'Большой транспорт',
204 => 'Лёгкий истребитель',
205 => 'Тяжёлый истребитель',
206 => 'Крейсер',
207 => 'Линкор',
208 => 'Колонизатор',
209 => 'Переработчик',
210 => 'Шпионский зонд',
211 => 'Бомбардировщик',
212 => 'Солнечный спутник',
213 => 'Уничтожитель',
214 => 'Звезда смерти',
215 => 'Линейный крейсер',
216 => 'Сверхновая звезда',
217 => 'Улучшенный транспорт',
218 => 'Аватар',
219 => 'Мега переработчик',
220 => 'Сборщик Тёмной материи',

400 => 'Оборона',
401 => 'Ракетная установка',
402 => 'Лёгкий лазер',
403 => 'Тяжёлый лазер',
404 => 'Пушка Гаусса',
405 => 'Ионное орудие',
406 => 'Плазменное орудие',
407 => 'Малый щитовой купол',
408 => 'Большой щитовой купол',
409 => 'Планетарный щитовой купол',
410 => 'Гравитонное орудие',
411 => 'Орбитальная база',

502 => 'Ракета-перехватчик',
503 => 'Межпланетная ракета',

600 => 'Офицеры',
601 => 'Геолог',
602 => 'Адмирал',
603 => 'Инженер',
604 => 'Технократ',
605 => 'Архитектор',
606 => 'Учёный',
607 => 'Хранитель',
608 => 'Министр обороны',
609 => 'Защитник',
610 => 'Разведчик',
611 => 'Командир',
612 => 'Уничтожитель',
613 => 'Генерал',
614 => 'Рейдер',
615 => 'Император',

700 => 'Вооружение',
701 => 'Мощность щитов',
702 => 'Время строительства',
703 => 'Добыча сырья',
704 => 'Выработка энергии',
705 => 'Время проведения исследований',
706 => 'Время полёта кораблей',
);

$LNG['res']['descriptions'] = array(
1   => 'Основной поставщик сырья для строительства несущих структур построек и кораблей.',
2   => 'Основной поставщик сырья для электронных строительных элементов и сплавов.',
3   => 'Извлекает из воды на планете незначительную долю дейтерия.',
4   => 'Производит энергию из солнечных лучей. Энергия требуется для работы большинства построек.',
6   => 'Чтобы сократить время проведения исследований, лучшие умы межгалактических исследовательских сетей объединились и разработали технополис. Он сокращает время проведения исследований на 8%. Хоть и не много, но на поздних этапах развития империи любая мелочь в этом плане дорогого стоит.',
12  => 'Добывает энергию из процесса образования атома гелия двумя атомами тяжёлого водорода.',
14  => 'Предоставляет простую рабочую силу, которую можно применять при строительстве планетарной инфраструктуры. Каждый уровень развития фабрики повышает скорость строительства зданий.',
15  => 'Представляет собой венец робототехники. Каждый уровень укорачивает время строительства зданий, кораблей и оборонительных сооружений вдвое.',
21  => 'В строительной верфи производятся все виды кораблей и оборонительных сооружений.',
22  => 'Хранилище для необработанных руд металлов до их дальнейшей переработки.',
23  => 'Хранилище для необработанного кристалла до его дальнейшей переработки.',
24  => 'Огромные ёмкости для хранения добытого дейтерия.',
31  => 'Необходима для исследования новых технологий.',
33  => 'Терраформер увеличивает пригодную для застройки площадь.',
34  => 'Склад альянса предоставляет возможность обеспечения топливом дружественных флотов, которые помогают при обороне и находятся на орбите',
41  => 'Луна не располагает атмосферой, поэтому перед заселением требуется соорудить лунную базу. Она обеспечивает необходимые воздух, гравитацию и тепло. Чем выше уровень развития лунной базы, тем больше обеспеченная биосферой площадь.',
42  => 'Высокочастотные сенсоры полностью просматривают спектр частот всех попадающих на фалангу излучений. Мощные компьютеры комбинируют мельчайшие колебания энергии и таким образом получают информацию о передвижениях кораблей на отдалённых планетах.',
43  => 'Телепорт - это огромные ворота, которые могут пересылать между собой флоты любых размеров без временных затрат. Телепорты не требуют дейтерия, однако между двумя прыжками должен пройти один час, иначе ворота перегреются. Невозможна также пересылка ресурсов. Весь процесс требует крайне высоко развитой технологии.',
44  => 'Служит для хранения ракет.',

106 => 'С помощью этой технологии добываются данные о других планетах.',
108 => 'С увеличением мощности компьютеров можно командовать всё большим количеством флотов. Каждый уровень компьютерной технологии увеличивает максимальное количество флотов на один.',
109 => 'Оружейная технология делает системы вооружения эффективней. Каждый уровень увеличивает мощность вооружения войсковых частей на 10% от основной мощности.',
110 => 'Эта технология делает щиты кораблей и оборонительных сооружений эффективней. Каждый уровень повышает эффективность щитов на 10% от основной мощности.',
111 => 'Специальные сплавы улучшают броню космических кораблей. Так, устойчивость брони может увеличиваться с каждым уровнем на 10% .',
113 => 'Обладание различными видами энергии необходимо для многих новых технологий.',
114 => 'Путём сплетения 4-го и 5-го измерения стало возможным исследовать новый более экономный и эффективный двигатель.',
115 => 'Дальнейшее развитие этих двигателей делает некоторые корабли быстрее, однако каждый уровень повышает скорость лишь на 10%.',
117 => 'Импульсный двигатель основывается на принципе отдачи. Дальнейшее развитие этих двигателей делает некоторые корабли быстрее, однако с каждым уровнем повышает скорость лишь на 20%.',
118 => 'Выгибает пространство вокруг корабля. Дальнейшее развитие этих двигателей делает некоторые корабли быстрее, каждый уровень повышает скорость на 30%.',
120 => 'Благодаря фокусированию света возникает луч, который при попадании на объект наносит ему повреждения.',
121 => 'Поистине смертоносный наводимый луч из ускоренных ионов. При попадании на какой-либо объект они наносят огромный ущерб.',
122 => 'Дальнейшее развитие ионной технологии, которая ускоряет не ионы, а высокоэнергетическую плазму. Она оказывает опустошительное действие при попадании на какой-либо объект.',
123 => 'Посредством этой сети учёные с различных планет могут обмениваться информацией.',
124 => 'Теперь корабли можно оснащать исследовательским модулем, обеспечивающим обработку собранных данных в условиях длительных полётов.',
131 => 'Благодаря передовым разработкам в сфере добычи металла, её возможно увеличить на 2% с каждым уровнем.',
132 => 'Благодаря передовым разработкам в сфере добычи кристалла, её возможно увеличить на 2% с каждым уровнем.',
133 => 'Благодаря передовым разработкам в сфере добычи дейтерия, её возможно увеличить на 2% с каждым уровнем.',
199 => 'Путём запуска концентрированного заряда частиц гравитона можно создавать искусственное гравитационное поле, благодаря которому можно уничтожать корабли или даже луны.',

202 => 'Малый транспорт - это манёвренный корабль, который может быстро транспортировать сырьё на другие планеты.',
203 => 'Дальнейшее развитие малых транспортов позволило создать корабли, обладающие большей вместительностью и, благодаря более развитому двигателю, способными передвигаться быстрее, чем малый транспорт, до тех пор, пока на малых транспортах не устанавливаются импульсные двигатели 5-го уровня',
204 => 'Лёгкий истребитель - это манёвренный корабль, который можно найти почти на каждой планете. Затраты на него не особо велики, однако щитовая мощность и вместимость очень малы.',
205 => 'Дальнейшее развитие лёгкого истребителя, он лучше защищён и обладает большей силой атаки.',
206 => 'Крейсеры почти втрое сильней защищены, чем тяжёлые истребители, а по огневой мощи они превосходят тяжёлые истребители более, чем в два раза. К тому же они очень быстры.',
207 => 'Линкоры как правило составляют основу флота. Их тяжёлые орудия, высокая скорость и большой грузовой тоннаж делают их серьёзными противниками.',
208 => 'При помощи этого корабля можно осваивать незаселённые планеты.',
209 => 'С помощью переработчика добывается сырьё из обломков.',
210 => 'Шпионские зонды - это маленькие манёвренные корабли, которые доставляют с больших расстояний данные о флотах и планетах.',
211 => 'Бомбардировщик был разработан специально для того, чтобы уничтожать планетарную оборону.',
212 => 'Солнечные спутники - это простые платформы из солнечных батарей, которые находятся на высокой орбите. Они собирают солнечный свет и передают энергию на наземную станцию.',
213 => 'Уничтожитель - король среди военных кораблей.',
214 => 'Уничтожительная мощь звезды смерти непревосходима.',
215 => 'Линейный крейсер специализируется на перехвате вражеских флотов.',
216 => 'Сверхновая звезда - самый мощный боевой корабль.',
217 => 'Дальнейшая разработка большого транспорта, более вместительного и быстрого.',
218 => 'При виде этого корабля, жители впадают в ужас и покидают колонии. Прекрасные боевые качества, но очень медленный.',
219 => 'Инженеры разработали новый переработчик, он летает быстрее и может собрать значительно больше обломков.',
220 => 'После долгих лет исследования Тёмной материи ученые научились добывать её из лунных минералов.',

401 => 'Ракетная установка - простое и дешёвое средство обороны.',
402 => 'При помощи концентрированного обстрела цели фотонами можно достичь значительно больших разрушений, чем при применении обычного баллистического вооружения.',
403 => 'Тяжелый лазер представляет собой дальнейшее развитие лёгкого лазера.',
404 => 'Пушка Гаусса ускоряет многотонные заряды с гигантскими затратами энергии.',
405 => 'Ионное орудие направляет на цель волну ионов, которая дестабилизирует щиты и повреждает электронику.',
406 => 'Плазменные орудия выпускают сгустки высокотемпературной плазмы и превосходят по своему разрушительному действию даже уничтожитель.',
407 => 'Малый щитовой защищает планету и поглощает удары атаки.',
408 => 'Дальнейшее развитие малого щитового купола. Он может сдерживать ещё более сильные атаки на планету, поглощая значительно большее количество энергии.',
409 => 'Самая мощная защита для ваших планет от вражеского флота.',
410 => 'После многолетних исследований в гравитационной технологии, ученым удалось создать гравитационную пушку которая генерирует небольшие концентрированные пучки и атакует ими противника.',
411 => 'Существование орбитальной базы требует колоссальных затрат энергии, но они с лихвой окупают себя при оборонительных операциях. Она не способна атаковать другие планеты, и находится на орбите в стационарном состоянии.',

502 => 'Ракеты-перехватчики уничтожают атакующие межпланетные ракеты.',
503 => 'Межпланетные ракеты уничтожают защиту противника.',

601 => 'Геолог - эксперт в астроминералогии и астрокристалографии. Он окажет помощь вашей команде в металлургии и химии, а также возьмется за межпланетные коммуникации, чтобы оптимизировать использование и утонченность грубой материи на протяжении всей империи.<br><br><strong><span style="color:lime">+5% добычи от шахт. Максимальный уровень 20</span></strong>',
602 => 'Адмирал - опытный ветеран войны и умелый стратег. В самых жестких сражениях, он способен найти выход из ситуации и контактировать с его подчиненными адмиралами. Мудрый император может пологаться на его помощь во время сражений.<br><br><strong><span style="color:lime">+5% к вооружению, щитам и броне. Максимальный уровень 20</span></strong>',
603 => 'Инженер - специалист по управлению энергией. В мирное время, инженер увеличивает энергию на всех колониях империи. В случае атаки, он гарантирует подачу энергии в пушки, предотвращая возможность дополнительной нагрузки, что приводит к сокращению потерянных в сражении единиц орудий защиты.<br><br><strong><span style="color:lime">+5% энергии. Максимальный уровень: 10</span></strong>',
604 => 'Гильдия технократов - это гениальные учёные, и их всегда можно найти там, где заканчивается грань технически возможного. Их код никогда не сможет разгадать ни один нормальный человек, и одним своим присутствием они вдохновляют учёных империи.<br><br><strong><span style="color:lime">+5% к скорости строительства кораблей. Максимальный уровень: 10</span></strong>',
605 => 'Архитектор - это незаменимый специалист в любом строительстве. Благодаря исследованиям и экспериментам, связанным с проектным решением, авторскому надзору за строительством и научному подходу, позволяет ускорить строительство и увеличить КПД строителей.<br><br><strong><span style="color:lime">-10% времени строительства построек. Максимальный уровень 3</span></strong>',
606 => 'Учёный так же входит в профсоюз технократов. Он специализируются в сокращении времени исследований технологий.<br><br><strong><span style="color:lime">-10% времени проведения исследований. Максимальный уровень 3</span></strong>',
607 => 'Кладовщик - из бывшего сообщества планеты Hsac. Его работа заключается в том, чтобы доверенные ему ресурсы не пропадали даром. Его разум позволил придумать выход, он создал новую технику хранения ресурсов.<br><br><strong><span style="color:lime">+50% вместимости хранилищ. Максимальный уровень 2</span></strong>',
608 => 'Защитник - член императорской армии. Его заслуга в его работе, которая позволяет ему строить огромную защиту от вражеских флотов в кратчайшие сроки.<br><br><strong><span style="color:lime">-50% времени строительства обороны. Максимальный уровень: 1</span></strong>',
609 => 'Император впечатлен вашей работой, которую Вы предоставляете империи. В качестве благодарности он позволит вам пользоваться самой мощной защитой.<br><br><strong><span style="color:lime">Возможность строить Планетарный щитовой купол</span></strong>',
610 => 'Разведчик - загадочный человек. Никто никогда не видел его истинное лицо, если только он не умрет.<br><br><strong><span style="color:lime">+5 уровней шпионажа. Максимальный уровень 2</span></strong>',
611 => 'Ранг командира неоднократно оправдал себя в современном ведении боя. Благодаря упрощённой структуре Ваши приказы могут исполняться быстрее, что позволит Вам сохранять контроль над всей Вашей империей! Вы сможете развивать стратегии, позволяющие всегда быть на шаг впереди противника.<br><br><strong><span style="color:lime">+3 дополнительных слота к флотам. Максимальный уровень: 3</span></strong>',
612 => 'Разрушитель - служащий без милосердия. Он истребляет все на планетах, только из-за того, что ему это нравится. В настоящее время он разрабатывает новый метод производства Звезд Смерти.<br><br><strong><span style="color:lime">2 ЗС вместо одной. Максимальный уровень: 1</span></strong>',
613 => 'Генерал - человек, который служит много лет в армии. Судостроители повышают производство в его присутствии.<br><br><strong><span style="color:lime">-25% времени строительства кораблей. Максимальный уровень: 3</span></strong>',
614 => 'Император обнаружил в Вас бесспорные качества завоевателя. Он предлагает Вам стать в Рейдером. Рейдер - самый высокий ранг императорской армии.<br><br><strong><span style="color:lime">Возможность строить Сверхновую звезду. Максимальный уровень: 1</span></strong>',
615 => 'Как выяснилось, Вы - великий завоеватель вселенной. Настал момент для того, чтобы Вы взяли место, которое Вы заслуживаете.<br><br><strong><span style="color:lime">Возможность разрушения планет. Максимальный уровень: 1</span></strong>',

700 => 'Повышает вооружение кораблей и обороны на %s%%. Бонус временный.',
701 => 'Повышает мощность щитов кораблей и обороны на %s%%. Бонус временный.',
702 => 'Уменьшает время строительства построек на %s%%. Бонус временный.',
703 => 'Повышает добычу сырья на %s%%. Бонус временный.',
704 => 'Повышает выработку энергии на %s%%. Бонус временный.',
705 => 'Уменьшает время проведения исследований на %s%%. Бонус временный.',
706 => 'Уменьшает время полёта кораблей на %s%%. Бонус временный.',
);

// Шахты
$LNG['info'][1]['name']          = 'Рудник метала';
$LNG['info'][1]['description']   = 'Основной поставщик сырья для строительства несущих структур построек и кораблей. Металл - самое дешёвое сырьё, но зато его требуется больше, чем всего остального. Для производства металла требуется меньше всего энергии. Чем рудники больше, тем они глубже. На большинстве планет металл находится на больших глубинах, при помощи этих более глубоких рудников можно добывать больше металлов, производство растёт. В то же время более крупные рудники требуют больше энергии.';
$LNG['info'][2]['name']          = 'Рудник кристалла';
$LNG['info'][2]['description']   = 'Основной поставщик сырья для электронных строительных элементов и сплавов. Для добычи кристалла требуется примерно вдвое больше энергии, чем для добычи металла, поэтому он, соответственно, ценится больше. Кристалл требуется для всех кораблей и зданий. К сожалению, большинство необходимых для строительства кораблей кристаллов очень редки и, как и большинство металлов, залегают на больших глубинах. Поэтому при усовершенствовании рудника также повышается производство, так как осваиваются более крупные и чистые залежи кристаллов.';
$LNG['info'][3]['name']          = 'Синтезатор дейтерия';
$LNG['info'][3]['description']   = 'Дейтерий - это тяжёлый водород. Из-за этого, как и на рудниках, более крупные запасы находятся на дне моря. Усовершенствование синтезатора также способствует освоению этих глубинных залежей дейтерия. Дейтерий необходим в качестве топлива для кораблей, почти для всех исследований, просмотра галактик, а также для использования сенсорной фаланги.';

// Энергия
$LNG['info'][4]['name']          = 'Солнечная электростанция';
$LNG['info'][4]['description']   = 'Для обеспечения энергией рудников и синтезаторов необходимы огромные солнечные электростанции. Чем больше построено станций, тем больше поверхности покрыто кварцевыми пластинами, которые перерабатывают световую энергию в электроэнергию. Солнечные электростанции представляют собой основу энергообеспечения планеты.';
$LNG['info'][12]['name']         = 'Термоядерная электростанция';
$LNG['info'][12]['description']  = 'На термоядерных электростанциях при помощи холодного термоядерного синтеза под огромным давлением и при большой температуре 2 атома тяжёлого дейтерия объединяются в один атом гелия. При этом, при образовании ядра гелия, вырабатывается энергия в 41,32*10^-13 джоулей в виде излучения (т.о. при сгорании 1 г дейтерия вырабатывается 172 мВт/ч энергии). Чем больше термоядерный реактор, тем сложнее процессы синтезирования, реактор производит больше энергии.';

// Постройки
$LNG['info'][6]['name']          = 'Технополис';
$LNG['info'][6]['description']   = 'Чтобы сократить время проведения исследований, лучшие умы межгалактических исследовательских сетей объединились и разработали технополис. Он сокращает время проведения исследований на 8%. Хоть и не много, но на поздних этапах развития империи любая мелочь в этом плане дорогого стоит.';
$LNG['info'][14]['name']         = 'Фабрика роботов';
$LNG['info'][14]['description']  = 'Предоставляет простую рабочую силу, которую можно применять при строительстве планетарной инфраструктуры. Каждый уровень развития фабрики повышает скорость строительства зданий.';
$LNG['info'][15]['name']         = 'Фабрика нанитов';
$LNG['info'][15]['description']  = 'Фабрика нанитов представляет собой венец робототехники. Наниты - это роботы размером в нанометр, которые путём объединения в сеть в состоянии выполнять экстраординарные задания. Сразу же после исследования они увеличивают производительность почти во всех областях. С каждым уровнем фабрика нанитов сокращает время строительства зданий, кораблей и оборонительных сооружений вдвое.';
$LNG['info'][21]['name']         = 'Верфь';
$LNG['info'][21]['description']  = 'В строительной верфи производятся все виды кораблей и оборонительных сооружений. Чем она больше, тем быстрее можно строить более сложные и более крупные корабли и оборонительные сооружения. Посредством строительства фабрики нанитов производятся миниатюрные роботы, которые помогают работникам работать быстрее.';
$LNG['info'][22]['name']         = 'Хранилище металла';
$LNG['info'][22]['description']  = 'Огромное хранилище для добытых руд. Чем оно больше, тем больше металла можно в нём хранить. Если оно заполнено, то добыча металла прекращается.';
$LNG['info'][23]['name']         = 'Хранилище кристалла';
$LNG['info'][23]['description']  = 'В этом огромном хранилище складируется ещё не обработанный кристалл. Чем хранилище больше, тем больше кристалла там можно хранить. Если оно заполнено, то добыча сего ресурса прекращается.';
$LNG['info'][24]['name']         = 'Ёмкость для дейтерия';
$LNG['info'][24]['description']  = 'Огромные ёмкости для хранения добытого дейтерия. Они обычно находятся вблизи космических портов. Чем они больше, тем больше дейтерия в них может сберегаться. Если они заполнены, то добыча дейтерия прекращается.';
$LNG['info'][31]['name']         = 'Исследовательская лаборатория';
$LNG['info'][31]['description']  = 'Для исследования новых технологий необходима работа исследовательской станции. Уровень развития исследовательской станции является решающим фактором того, как быстро могут быть освоены новые технологии. Чем выше уровень развития исследовательской лаборатории, тем больше может быть исследовано новых технологий. Для того, чтобы как можно быстрее завершить исследовательские работы на одной планете, на неё посылаются все имеющиеся в наличии учёные и, таким образом, покидают свои планеты. Как только технология исследована, учёные возвращаются на свои родные планеты и переносят с собой знания о ней. Так новые технологии можно применять и на других планетах.';
$LNG['info'][33]['name']         = 'Терраформер';
$LNG['info'][33]['description']  = 'По мере застройки планет всё более важным становился вопрос об ограниченности пригодных для использования площадей. Такие традиционные методы, как строительство ввысь и вглубь, оказались недостаточными. Маленькая группа физиков и нанотехников нашла решение - терраформер. Затрачивая огромное количество энергии терраформер может преобразовывать огромные территории и даже целые континенты, делая их пригодными для застройки. В этом строении беспрерывно производятся специальные наниты, отвечающие за постоянное качество почвы.';
$LNG['info'][34]['name']         = 'Склад альянса';
$LNG['info'][34]['description']  = 'Склад альянса предоставляет возможность обеспечения топливом дружественных флотов, которые помогают при обороне и находятся на орбите. С каждым уровнем развития можно посылать флотам на орбите дополнительно 10 000 единиц дейтерия в час.';

// Лунные постройки
$LNG['info'][41]['name']         = 'Лунная база';
$LNG['info'][41]['description']  = 'Луна не располагает атмосферой, поэтому перед заселением требуется соорудить лунную базу. Она обеспечивает необходимые воздух, гравитацию и тепло. Чем выше уровень развития лунной базы, тем больше обеспеченная биосферой площадь. Каждый уровень лунной базы может застроить 3 поля, максимум до площади всей луны. Она составляет 2 (диаметр луны/1000), причём каждый уровень лунной базы сам занимает одно поле.';
$LNG['info'][42]['name']         = 'Сенсорная фаланга';
$LNG['info'][42]['description']  = 'Высокочастотные сенсоры полностью просматривают спектр частот всех попадающих на фалангу излучений. Мощные компьютеры комбинируют мельчайшие колебания энергии и таким образом получают информацию о передвижениях кораблей на отдалённых планетах. Для просмотра на луне должна быть предоставлена энергия в форме дейтерия (5 000 за просмотр). Просмотр осуществляется переходом с луны в меню Галактика и на название вражеской планеты, находящейся в радиусе действия сенсоров (формула: (уровень фаланги)^2-1 систем).';
$LNG['info'][43]['name']         = 'Телепорт';
$LNG['info'][43]['description']  = 'Телепорт - это огромные врата, которые могут пересылать между собой флоты любых размеров без временных затрат. Телепорт не требуют дейтерия, однако между двумя прыжками должен пройти один час, иначе телепорт перегреется. Невозможна также пересылка ресурсов. Весь процесс требует крайне высоко развитой технологии.';
$LNG['info'][44]['name']         = 'Ракетная шахта';
$LNG['info'][44]['description']  = 'Ракетные шахты служат для хранения ракет. С каждым уровнем можно хранить на пять межпланетных или десять ракет-перехватчиков больше. Одна межпланетная ракета требует места в два раза больше, чем ракета-перехватчик. Возможно любое комбинирование различных типов ракет.';

// Исслдеования
$LNG['info'][106]['name']        = 'Шпионаж';
$LNG['info'][106]['description'] = 'Шпионаж предназначен для исследования новых и более эффективных сенсоров. Чем выше развита эта технология, тем больше информации имеет игрок о событиях в своём окружении. Разница в уровнях шпионажа с противником играет решающую роль - чем больше исследована собственная шпионская технология, тем больше информации содержится в разведданных и тем меньше шанс быть обнаруженным. Чем больше послано зондов, тем больше собирается подробностей о противнике, но при этом растёт опасность быть обнаруженным. Также шпионаж совершенствует определение местонахождения чужих флотов. При этом также важен уровень развития собственного шпионажа.';
$LNG['info'][108]['name']        = 'Компьютерная технология';
$LNG['info'][108]['description'] = 'Компьютерная технология предназначена для расширения имеющихся в наличии компьютерных мощностей. В результате на планете развиваются более продуктивные и эффективные компьютерные системы, возрастает вычислительная мощность и скорость протекания вычислительных процессов. С повышением мощности компьютеров можно одновременно командовать всё бoльшим количеством флотов. Каждый уровень развития компьютерной технологии даёт возможность командовать +1 флотом. Чем больше рассылается флотов, тем больше можно совершать налётов и тем самым захватывать больше сырья. Естественно, что эта технология полезна и торговцам, так как она позволяет им одновременно рассылать больше торговых флотов. По этой причине следует постоянно развивать компьютерную технологию на протяжении всей игры.';
$LNG['info'][109]['name']        = 'Оружейная технология';
$LNG['info'][109]['description'] = 'Оружейная технология занимается прежде всего дальнейшим развитием имеющихся в наличии систем вооружения. При этом особое значение придаётся тому, чтобы снабжать имеющиеся в наличии системы большей энергией и более точно эту энергию направлять. Благодаря этому системы вооружения становятся эффективней, а оружие вызывает больше разрушений. Каждый уровень оружейной технологии увеличивает мощность вооружения войсковых частей на 10%. Оружейная технология важна для конкурентоспособного содержания частей. Поэтому следовало бы её постоянно развивать в течение всей игры.';
$LNG['info'][110]['name']        = 'Щитовая технология';
$LNG['info'][110]['description'] = 'Эта технология занимается изучением более новых возможностей большего энергоснабжения щитов, что делает их эффективней и устойчивей. Благодаря этому с каждым изученным уровнем эффективность щитов повышается на 10%.';
$LNG['info'][111]['name']        = 'Броня космических кораблей';
$LNG['info'][111]['description'] = 'Специальные сплавы улучшают броню космических кораблей. Как только найден очень стойкий сплав, специальные лучи изменяют молекулярную структуру космического корабля, и доводит её до состояния изученного сплава. Так, устойчивость брони может увеличиваться с каждым уровнем на 10%.';
$LNG['info'][113]['name']        = 'Энергетическая технология';
$LNG['info'][113]['description'] = 'Энергетическая технология занимается дальнейшим развитием систем передачи и хранения энергии, которые необходимы для многих новых технологий.';
$LNG['info'][114]['name']        = 'Гиперпространственная технология';
$LNG['info'][114]['description'] = 'Путём сплетения 4-го и 5-го измерения стало возможным исследовать новый более экономный и эффективный двигатель.';
$LNG['info'][115]['name']        = 'Реактивный двигатель';
$LNG['info'][115]['description'] = 'В основе реактивного двигателя лежит закон сохранения импульса. Материя, разогретая до высоких температур, выбрасывается в направлении, противоположном движению и даёт ускорение кораблю. Эффективность этих двигателей достаточно мала, но они достаточно надёжны, дёшевы в производстве и обслуживании. Кроме того они занимают гораздо меньше места на корабле по сравнению с остальными двигателями, поэтому их всё ещё достаточно часто можно встретить на маленьких кораблях. Так как реактивные двигатели являются основой любого полёта в космос, следует исследовать их как можно раньше. Дальнейшее развитие этих двигателей делает следующие корабли с каждым уровнем на 10% быстрее: малые и большие транспорты, лёгкие истребители и шпионские зонды.';
$LNG['info'][117]['name']        = 'Импульсный двигатель';
$LNG['info'][117]['description'] = 'Импульсный двигатель основывается на принципе отдачи, при котором возникает масса лучей, по большей части в виде побочного продукта ядерного синтеза, использованного для получения энергии. Также можно впрыснуть дополнительную массу. Дальнейшее развитие этих двигателей делает следующие корабли с каждым уровнем на 20% быстрее: бомбардировщики, крейсеры, тяжёлые истребители и колонизаторы. Каждый уровень развития увеличивает радиус действия межпланетных ракет.';
$LNG['info'][118]['name']        = 'Гиперпространственный двигатель';
$LNG['info'][118]['description'] = 'Благодаря пространственно-временному изгибу в непосредственном окружении корабля пространство сжимается, чем быстрее преодолеваются далёкие расстояния. Чем выше развит гиперпространственный привод, тем выше сжатие пространства, благодаря чему с каждым уровнем скорость кораблей повышается на 30%.';
$LNG['info'][120]['name']        = 'Лазерная технология';
$LNG['info'][120]['description'] = 'Лазеры (усиление света при помощи индуцированного выброса излучения) производят насыщенный энергетический луч когерентного света. Эти приборы находят применение во всевозможных областях, от оптических компьютеров до тяжёлых лазеров, которые свободно режут броню космических кораблей. Лазерная технология является важным элементом для исследования дальнейших оружейных технологий.';
$LNG['info'][121]['name']        = 'Ионная технология';
$LNG['info'][121]['description'] = 'Поистине смертоносный наводимый луч из ускоренных ионов. При попадании на какой-либо объект они наносят огромный ущерб.';
$LNG['info'][122]['name']        = 'Плазменная технология';
$LNG['info'][122]['description'] = 'Дальнейшее развитие ионной технологии, которая ускоряет не ионы, а высокоэнергетическую плазму. Она оказывает опустошительное действие при попадании на какой-либо объект.';
$LNG['info'][123]['name']        = 'Межгалактическая исследовательская сеть';
$LNG['info'][123]['description'] = 'Эта сеть делает возможным общение учёных, работающих в исследовательских лабораториях разных планет. Каждый новый уровень позволяет присоединить к сети дополнительную лабораторию (в первую очередь присоединяются лаборатории старших уровней). Из всех объединённых в сеть лабораторий, в каждом исследовании принимают участие только те, которые имеют достаточный для проведения данного исследования уровень. Скорость исследования соответствует сумме уровней участвующих в нём лабораторий.';
$LNG['info'][124]['name']        = 'Астрофизика';
$LNG['info'][124]['description'] = 'Последующие исследование в области Астрофизики позволили создавать лаборатории, которые способны размещаться на все большем числе кораблей. Это сделало возможным длительные экспедиции к неосвоенным глубинам космоса. Так же это помогает колонизировать новые планеты. Каждые два уровня этой технологии позволят вам освоить дополнительную планету (1 уровень + 1 планета, 3 уровень + ещё 1 планета, 5 уровень + ещё 1 планета и т.д.).';
$LNG['info'][131]['name']        = 'Технология добычи металла';
$LNG['info'][131]['description'] = 'Благодаря передовым разработкам в сфере добычи металла, её возможно увеличить на 2% с каждым уровнем.';
$LNG['info'][132]['name']        = 'Технология добычи кристалла';
$LNG['info'][132]['description'] = 'Благодаря передовым разработкам в сфере добычи кристалла, её возможно увеличить на 2% с каждым уровнем.';
$LNG['info'][133]['name']        = 'Технология добычи дейтерия';
$LNG['info'][133]['description'] = 'Благодаря передовым разработкам в сфере добычи дейтерия, её возможно увеличить на 2% с каждым уровнем.';
$LNG['info'][199]['name']        = 'Гравитационная технология';
$LNG['info'][199]['description'] = 'Гравитон - это частица, которая не обладает ни массой ни зарядом и определяет силу притяжения. Путём запуска концентрированного заряда гравитонов можно создавать искусственное гравитационное поле, которое, подобно чёрной дыре, втягивает в себя массу, благодаря чему можно уничтожать корабли или даже луны. Чтобы произвести достаточное количество гравитонов, требуются огромные количества энергии.';

// Верфь
$LNG['info'][202]['name']        = 'Малый транспорт';
$LNG['info'][202]['description'] = 'Транспорты имеют примерно такой же размер, что и истребители, но они не обладают мощными двигателями и бортовым вооружением ради экономии места. Малый транспорт вмещает 5000 единиц сырья. По причине малой огневой мощи малые транспорты часто сопровождаются другими кораблями.';
$LNG['info'][203]['name']        = 'Большой транспорт';
$LNG['info'][203]['description'] = 'У этого корабля нет ни вооружения, ни каких-либо других технологий на борту. По этой причине никогда не следует запускать их без спровождения. Благодаря своему высокоразвитому двигателю внутреннего сгорания большой транспорт служит в качестве быстрого межпланетного доставщика ресурсов, также он сопровождает флоты при нападениях на вражеские планеты, чтобы захватить как можно больше ресурсов.';
$LNG['info'][204]['name']        = 'Лёгкий истребитель';
$LNG['info'][204]['description'] = 'Лёгкий истребитель - это манёвренный корабль, который можно найти почти на каждой планете. Затраты на нем не особо велики, однако щитовая мощность и вместимость очень малы.';
$LNG['info'][205]['name']        = 'Тяжёлый истребитель';
$LNG['info'][205]['description'] = 'При дальнейшем развитии лёгкого истребителя учёные дошли до момента, когда стало ясно, что обыкновенный двигатель не обладает необходимой мощью. Для того, чтобы оптимально передвигать корабль был впервые использован импульсный двигатель. Хоть он и повысил стоимость, однако он также открыл новые возможности. Благодаря применению этого двигателя осталось больше энергии для вооружения и щитов, кроме того, для этого вида истребителей также использовались ценные материалы. Это привело к улучшенной структурной целостности и более сильной огневой мощи, благодаря чему в бою он представляет бoльшую угрозу, чем его предшественник. После этих изменений тяжёлый истребитель представляет собой новую эру технологии кораблестроения, основу технологии крейсеростроения.';
$LNG['info'][206]['name']        = 'Крейсер';
$LNG['info'][206]['description'] = 'С развитием тяжёлых лазеров и ионных пушек тяжёлые истребители всё больше вытеснялись. Несмотря на многочисленные усовершенствования огневая мощь и бронирование не могли быть настолько изменены, чтобы действенно противостоять этим оборонительным орудиям. Поэтому было решено построить новый класс кораблей, который объединял бы в себе больше бронирования и огневой мощи. Так появился крейсер. Крейсеры почти втрое сильней защищены, чем тяжёлые истребители и обладают более чем удвоенной огневой мощью. К тому же они очень быстры. Нет лучшего оружия против средней защиты. Почти столетие крейсеры неограниченно господствовали во вселенной. С появлением орудий Гаусса и плазменных орудий их господство закончилось. Однако и сегодня их охотно применяют против групп истребителей.';
$LNG['info'][207]['name']        = 'Линкор';
$LNG['info'][207]['description'] = 'Линкоры как правило составляют основу флота. Их тяжёлые орудия, высокая скорость и большой грузовой тоннаж делают их серьёзными противниками.';
$LNG['info'][208]['name']        = 'Колонизатор';
$LNG['info'][208]['description'] = 'Этот хорошо защищённый корабль служит покорению новых планет, что необходимо развивающейся империи. Он используется в новой колонии в качестве поставщика сырья - его разбирают и используют весь полезный материал для освоения нового света. Каждая империя, включая главную планету, может колонизировать максимум 9 планет.Этот хорошо защищённый корабль служит покорению новых планет, что необходимо развивающейся империи. Он используется в новой колонии в качестве поставщика сырья - его разбирают и используют весь полезный материал для освоения нового света. Каждая империя, включая главную планету, может колонизировать максимум 9 планет.';
$LNG['info'][209]['name']        = 'Переработчик';
$LNG['info'][209]['description'] = 'Космические бои принимали всё бoльшие масштабы. Уничтожались тысячи кораблей и возникавшие при этом обломки казались навсегда потерянными. Нормальные транспорты не могли близко к ним приблизиться, не будучи сильно повреждёнными маленькими обломками. С новым открытием в области щитовой технологии стало возможно эффективно устранять эту проблему, возник новый класс корабля, подобный большому транспорту - переработчик. С его помощью можно было заново использовать казавшиеся потерянными ресурсы. Из-за новых щитов маленькие обломки больше не представляли собой опасности. К сожалению, эти устройства требуют пространства, поэтому его грузовой тоннаж ограничен до 20 000.';
$LNG['info'][210]['name']        = 'Шпионский зонд';
$LNG['info'][210]['description'] = 'Шпионские зонды - это маленькие манёвренные корабли, которые доставляют с больших расстояний данные о флотах и планетах. Их высокомощный двигатель позволяет им преодолевать большие расстояния за несколько секунд. Однажды попав на орбиту какой-нибудь планеты, они пребывают там некоторое время для сборки данных. В это время враг может их относительно легко обнаружить и атаковать. Для экономии места не было установлено ни брони, ни щитов, ни орудий, что делает зонды в случае обнаружения лёгкими целями.';
$LNG['info'][211]['name']        = 'Бомбардировщик';
$LNG['info'][211]['description'] = 'Бомбардировщик был разработан специально для того, чтобы уничтожать планетарную защиту. С помощью лазерного прицела он точно сбрасывает плазменные бомбы на поверхность планеты и таким образом наносит огромные повреждения оборонительным сооружениям.<br><br>Когда гиперпространственный двигатель исследован до 8-й ступени, у бомбардировщика повышается базовая скорость и он оснащается этим типом двигателя.';
$LNG['info'][212]['name']        = 'Солнечный спутник';
$LNG['info'][212]['description'] = 'Солнечные спутники запускаются на орбиту планеты. Они фокусируют солнечную энергию и передают её на наземную станцию. Эффективность солнечных спутников зависит от мощи солнечного излучения. В принципе, добыча энергии на орбитах, более приближённых к солнцу, выше, чем на планетах, удалённых от солнца. Из-за своего соотношения цены и качества солнечные спутники решают энергетические проблемы многих миров. Но внимание: солнечные спутники могут быть уничтожены в бою.';
$LNG['info'][213]['name']        = 'Уничтожитель';
$LNG['info'][213]['description'] = 'Уничтожитель - король среди военных кораблей. Его мультифланговые ионные, плазменные и гауссовые орудийные башни могут благодаря своим усовершенствованным пеленгационным сенсорам поражать с точностью до 99% даже скоростные манёвренные истребители. Так как уничтожители очень велики, их манёвренность очень ограничена, и в бою они подобны скорее боевой станции, чем боевому кораблю. Потребление дейтерия у них так же высоко, как и их боевая мощь.';
$LNG['info'][214]['name']        = 'Звезда смерти';
$LNG['info'][214]['description'] = 'Звезда смерти оснащена гравитонной пушкой, которая может уничтожать такие корабли, как уничтожитель, и даже луны. Так как для этого требуется большое количество энергии, она состоит почти лишь из генераторов. Только огромные звёздные империи имеют достаточно ресурсов и работников для строительства этого огромного корабля.';
$LNG['info'][215]['name']        = 'Линейный крейсер';
$LNG['info'][215]['description'] = 'Этот высокотехнологичный корабль несёт смерть атакующим флотам. Его усовершенствованные лазерные орудия удерживают тяжёлые корабли противника на расстоянии и могут уничтожать несколько единиц одним залпом. За счёт его малых размеров и невероятно мощного вооружения, грузоподъёмность линейного крейсера очень мала, но за счёт гиперпространственного двигателя также мало потребление топлива.';
$LNG['info'][216]['name']        = 'Сверхновая звезда';
$LNG['info'][216]['description'] = 'Сверхновая звезда. Вам предоставляется вознаграждение со стороны императора за ваши навыки жестокости.';
$LNG['info'][217]['name']        = 'Улучшенный транспорт';
$LNG['info'][217]['description'] = 'Дальнейшая разработка большого транспорта, более вместительного и быстрого.';
$LNG['info'][218]['name']        = 'Аватар';
$LNG['info'][218]['description'] = 'При виде этого корабля, жители впадают в ужас и покидают колонии. Прекрасные боевые качества, но очень медленный.';
$LNG['info'][219]['name']        = 'Мега переработчик';
$LNG['info'][219]['description'] = 'Инженеры разработали новый переработчик, он летает быстрее и может собрать значительно больше обломков.';
$LNG['info'][220]['name']        = 'Сборщик Тёмной материи';
$LNG['info'][220]['description'] = 'После долгих  лет исследования Тёмной материи ученые научились добывать её из луны.';

// Оборона
$LNG['info'][401]['name']        = 'Ракетная установка';
$LNG['info'][401]['description'] = 'Ракетная установка - простое и дешёвое средство обороны. Так как это развитие обычных баллистических орудий, то ему не требуется дальнейшей модернизации. Малые затраты на его производство оправдывают его применение против более маленьких флотов, но со временем он теряет значение. Позднее его используют лишь для отвода вражеских выстрелов. Оборонительные сооружения деактивируются сами по себе, как только они сильно повреждаются. Возможность восстановления оборонительных сооружений после боя составляет до 70%.';
$LNG['info'][402]['name']        = 'Лёгкий лазер';
$LNG['info'][402]['description'] = 'Для компенсации чрезмерных успехов в области технологии космических кораблей учёные должны были создать оборонительное сооружение, справляющееся с более крупными и лучше вооружёнными флотами. Это привело к появлению рождение лёгкого лазера. При помощи концентрированного обстрела цели фотонами можно достичь значительно бoльших разрушений, чем при применении обычного баллистического вооружения. Для противостояния более сильной огневой мощи новых типов кораблей он также оснащён усовершенствованными щитами. Однако, чтобы стоимость производства оставалась низкой, структура дальше не усиливалась. Лёгкий лазер обладает наилучшим соотношением цены и качества, поэтому он также интересен и для более развитых цивилизаций. Оборонительные сооружения деактивируются сами по себе, как только они сильно повреждаются. Возможность восстановления оборонительных сооружений после боя составляет до 70%.';
$LNG['info'][403]['name']        = 'Тяжёлый лазер';
$LNG['info'][403]['description'] = 'Тяжёлый лазер представляет собой дальнейшее развитие лёгкого лазера. Структура была усилена и усовершенствована новыми материалами. Оболочку смогли сделать значительно более стойкой. Одновременно была улучшена и энергетическая система и целевой компьютер, так что тяжёлый лазер может концентрировать значительно больше энергии на цели. Оборонительные сооружения деактивируются сами по себе, как только они сильно повреждаются. Возможность восстановления оборонительных сооружений после боя составляет до 70%.';
$LNG['info'][404]['name']        = 'Пушка Гаусса';
$LNG['info'][404]['description'] = 'Долгое время артиллерийские орудия считались устаревшими по сравнению с современной ядерной и энергетической техникой, развитием гиперпространственного привода и постоянно улучшающимися бронировками, пока именно энергетическая техника, которая их когда-то оттесняла, не помогла им занять их исконное место. Вообще-то принцип ускорителя частиц был известен на Земле уже с 20-го и 21-го столетий. Пушка Гаусса - это ничто иное, как значительно бoльшая версия этой конструкции. Многотонные заряды магнетически ускоряются при огромных затратах энергии и имеют такую выходную скорость, что частички грязи в воздухе вокруг заряда сгорают, а отдача сотрясает землю. Даже современные бронировки и щиты могут с трудом противостоять этой пробивной силе, и нередко случается так, что цель просто простреливается насквозь. Оборонительные сооружения деактивируются сами по себе, как только они сильно повреждаются. Возможность восстановления оборонительных сооружений после боя составляет до 70%.';
$LNG['info'][405]['name']        = 'Ионное орудие';
$LNG['info'][405]['description'] = 'В 21-м столетии на Земле уже существовало то, что общеизвестно как ЭМИ. ЭМИ означает электромагнитный импульс, который обладает способностью индуцировать дополнительные напряжения в схемы и тем самым причинять массовые помехи, которые могут уничтожить все чувствительные приборы. Тогда ЭМИ-орудия были в основном на базе ракет и бомб, также в комбинации с ядерными орудиями. Между тем ЭМИ постоянно развивался, так как в нём видели большой потенциал не уничтожать цели, а делать их неспособными к бою и манёвренности и, тем самым, упрощать их захват. Пока что наивысшая форма ЭМИ-орудий представлена ионным орудием. Оно направляет на цель волну ионов (электрически заряженных частиц), которая дестабилизирует щиты и повреждает электронику, только если она не очень хорошо защищена, что иногда подобно полному уничтожению. Кинетической пробивной силой можно пренебречь. Ионная техника используется только на крейсерах, так как потребление энергии ионными орудиями огромно, и в бою часто приходится уничтожить, а не парализовать цель. Оборонительные сооружения деактивируются сами по себе, как только они сильно повреждаются. Возможность восстановления оборонительных сооружений после боя составляет до 70%.';
$LNG['info'][406]['name']        = 'Плазменное орудие';
$LNG['info'][406]['description'] = 'Лазерная технология была доведена до совершенства, ионная техника достигла конечной стадии и считалось, что практически невозможно, даже с качественной точки зрения орудийной системы, достичь ещё больше эффективности. Но всё должно было измениться, когда появилась идея объединить обе системы. Из термоядерной технологии известно, что лазеры нагревают частицы (обычно дейтерия) до крайне высоких температур, исчисляемых в миллионах градусов. Ионная техника обогащает их электрическим зарядом, стабилизационными полями и ускорителями. Как только заряд достаточно нагрет, ионизирован и находится под давлением, то его выпускают посредством ускорителей во вселенские дали в направлении цели. Светящийся голубоватым цветом плазменный шар выглядит внушительно, только спрашивается, долго ли им будет наслаждаться команда корабля-цели, если через несколько секунд броня разорвётся на куски, а электроника сгорит... Плазменное орудие считается вообще самым страшным оружием, и у этой техники есть своя цена. Оборонительные сооружения деактивируются сами по себе, как только они сильно повреждаются. Возможность восстановления оборонительных сооружений после боя составляет до 70%.';
$LNG['info'][407]['name']        = 'Малый щитовой купол';
$LNG['info'][407]['description'] = 'Задолго до того, как щитовые генераторы были достаточно малы, чтобы найти применение на кораблях, уже существовали огромные генераторы на поверхности планет. Они обволакивали целую планету силовым полем, которое могло поглощать удары атаки. Малые атакующие флоты постоянно разбиваются об эти купола. Благодаря растущему технологическому развитию эти щиты можно ещё усилить. Позже можно строить более сильный большой купол. На каждой планете можно построить только один малый купол.';
$LNG['info'][408]['name']        = 'Большой щитовой купол';
$LNG['info'][408]['description'] = 'Дальнейшее развитие малого купола. Он может сдерживать ещё более сильные атаки на планету, поглощая значительно большее количество энергии.';
$LNG['info'][409]['name']        = 'Планетарный щитовой купол';
$LNG['info'][409]['description'] = 'Самая мощная защита для ваших планет от вражеского флота.';
$LNG['info'][410]['name']        = 'Гравитонное орудие';
$LNG['info'][410]['description'] = 'После многолетних исследований в гравитационной технологии, ученым удалось создать гравитационную пушку которая генерирует небольшие концентрированные пучки и атакует ими противника.';
$LNG['info'][411]['name']        = 'Орбитальная база';
$LNG['info'][411]['description'] = 'Существование орбитальной базы требует колоссальных затрат энергии, но они с лихвой окупают себя при оборонительных операциях. Она не способна атаковать другие планеты, и находится на орбите в стационарном состоянии.';

// Ракеты
$LNG['info'][502]['name']        = 'Ракета-перехватчик';
$LNG['info'][502]['description'] = 'Ракеты-перехватчики уничтожают атакующие межпланетные ракеты. Одна ракета-перехватчик уничтожает одну межпланетную ракету.';
$LNG['info'][503]['name']        = 'Межпланетная ракета';
$LNG['info'][503]['description'] = 'Межпланетные ракеты уничтожают защиту противника. Уничтоженные межпланетными ракетами оборонительные сооружения больше не восстанавливаются.';

// Офицеры
$LNG['info'][601]['name']        = 'Геолог';
$LNG['info'][601]['description'] = '<br><br>Геолог - это признанный эксперт в астроминералогии и кристаллографии. Он со своей командой металлургов и химиков поддерживает межпланетные правительства при разработке новых источников ресурсов и оптимизации их очистки.<br><br><span style="color:red">+5% добычи от шахт. Максимальный уровень 20</span>';
$LNG['info'][602]['name']        = 'Адмирал';
$LNG['info'][602]['description'] = '<br><br>Адмирал - это испытанный войной ветеран и гениальный стратег. Даже в самых горячих боях он не теряет обзора и поддерживает контакт с подчинёнными ему адмиралами. Мудрый правитель может полностью положиться на него в бою и тем самым использовать для боя больше кораблей.<br><br><span style="color:red">+5% к вооружению, щитам и броне. Максимальный уровень 20</span>';
$LNG['info'][603]['name']        = 'Инженер';
$LNG['info'][603]['description'] = '<br><br>Инженер - это специалист по управлению энергией. В мирное время он повышает уровень энергетических сетей на колониях. В случае нападения он снабжает энергетические системы планетарных защит и предотвращает перегрузки, что ведёт к значительно меньшей степени потерь в бою.<br><br><span style="color:red">+5% энергии. Максимальный уровень 10</span>';
$LNG['info'][604]['name']        = 'Технократ';
$LNG['info'][604]['description'] = '<br><br>Гильдия технократов - это гениальные учёные, и их всегда можно найти там, где заканчивается грань технически возможного. Их код никогда не сможет разгадать ни один нормальный человек, и одним своим присутствием они вдохновляют учёных империи.<br><br><span style="color:red">-5% времени строительства кораблей. Максимальный уровень 10</span>';
$LNG['info'][605]['name']        = 'Архитектор';
$LNG['info'][605]['description'] = '<br><br>Архитектор - это незаменимый специалист в любом строительстве. Благодаря исследованиям и экспериментам, связанным с проектным решением, авторскому надзору за строительством и научному подходу, позволяет ускорить строительство и увеличить КПД строителей.<br><br><span style="color:red">-10% времени строительства построек. Максимальный уровень 3</span>';
$LNG['info'][606]['name']        = 'Учёный';
$LNG['info'][606]['description'] = '<br><br>Учёный так же входит в профсоюз технократов. Он специализируются в сокращении времени изучения исследований.<br><br><span style="color:red">-10% времени проведения исследований. Максимальный уровень 3</span>';
$LNG['info'][607]['name']        = 'Хранитель';
$LNG['info'][607]['description'] = '<br><br>Работа хранителя заключается в том, чтобы доверенные ему ресурсы не пропадали даром. Его разум позволил придумать выход, он создал новую технику хранения ресурсов.<br><br><span style="color:red">+50% вместимости хранилищ. Максимальный уровень 2</span>';
$LNG['info'][608]['name']        = 'Министр обороны';
$LNG['info'][608]['description'] = '<br><br>Защитник - член императорской армии. Его заслуга в его работе, которая позволяет ему строить огромную защиту от вражеских флотов в кратчайшие сроки.<br><br><span style="color:red">-50% времени строительства обороны. Максимальный уровень: 1</span>';
$LNG['info'][609]['name']        = 'Защитник';
$LNG['info'][609]['description'] = '<br><br>Император впечатлен вашей работой, которую Вы предоставляете империи. В качестве благодарности он позволит вам пользоваться самой мощной защитой.<br><br><span style="color:red">Возможность строить Планетарный щитовой купол</span>';
$LNG['info'][610]['name']        = 'Разведчик';
$LNG['info'][610]['description'] = '<br><br>Разведчик - загадочный человек. Никто никогда не видел его истинное лицо, и не увидит, пока он не умрет.<br><br><span style="color:red">+5 уровней шпионажа. Максимальный уровень 2</span>';
$LNG['info'][611]['name']        = 'Командир';
$LNG['info'][611]['description'] = '<br><br>Ранг командира неоднократно оправдал себя в современном ведении боя. Благодаря упрощённой структуре Ваши приказы могут исполняться быстрее, что позволит Вам сохранять контроль над всей Вашей империей! Вы сможете развивать стратегии, позволяющие всегда быть на шаг впереди противника.<br><br><span style="color:red">+3 дополнительных слота к флотам. Максимальный уровень: 3</span>';
$LNG['info'][612]['name']        = 'Уничтожитель';
$LNG['info'][612]['description'] = '<br><br>Разрушитель - служащий без милосердия. Он истребляет все на планетах, только из-за того, что ему это нравится. В настоящее время он разрабатывает новый метод производства Звезды Смерти.<br><br><span style="color:red">2 ЗС вместо одной. Максимальный уровень 1</span>';
$LNG['info'][613]['name']        = 'Генерал';
$LNG['info'][613]['description'] = '<br><br>Генерал - человек, который служит много лет в армии. Судостроители повышают производство в его присутствии.<br><br><span style="color:red">-25% времени строительства кораблей. Максимальный уровень: 3</span>';
$LNG['info'][614]['name']        = 'Рейдер';
$LNG['info'][614]['description'] = '<br><br>Император обнаружил в Вас бесспорные качества завоевателя. Он предлагает Вам стать в Рейдером. Рейдер - самый высокий ранг императорской армии.<br><br><span style="color:red">Возможность строить Сверхновую звезду. Максимальный уровень: 1</span>';
$LNG['info'][615]['name']        = 'Император';
$LNG['info'][615]['description'] = '<br><br>Как выяснилось, Вы - великий завоеватель вселенной. Настал момент для того, чтобы Вы взяли место, которое Вы заслуживаете.<br><br><span style="color:red">Возможность разрушать планеты.</span>';

// Translated into Russian by InquisitorEA. All rights reserved (C) 2010-2011

?>